[
  {
    "video_id": "cpSGLLyYIG4",
    "title": "Mayor hit in rocket launcher attack in the Philippines. #Philippines #BBCNews",
    "description": "",
    "published_at": "2026-01-29T22:33:34Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT33S",
    "views": 18421,
    "likes": 347,
    "comments_count": 44,
    "comments": [
      {
        "author": "@Unhacker",
        "text": "Damn that TrueCoat really is worth the extra $300 😂",
        "likes": 16,
        "published_at": "2026-01-29T23:42:48Z"
      },
      {
        "author": "@LeoricDaKnight",
        "text": "Best Toyota commercial ever",
        "likes": 10,
        "published_at": "2026-01-30T05:21:03Z"
      },
      {
        "author": "@jeanr.3048",
        "text": "The question is: Why is he keep being attacked? What is he doing that is so bad that his citizens are literally hurling rocket launchers at him? That&#39;s intense, a rocker launcher? Where did he even get one?!",
        "likes": 22,
        "published_at": "2026-01-29T23:31:47Z"
      },
      {
        "author": "@cryptobanzai",
        "text": "That’s crazy",
        "likes": 3,
        "published_at": "2026-01-30T00:37:56Z"
      },
      {
        "author": "@Freelancer-kd4zr",
        "text": "Some assassins use handguns others use RPG-3’s.",
        "likes": 3,
        "published_at": "2026-01-30T01:31:49Z"
      },
      {
        "author": "@jonfrodsham4216",
        "text": "Well. Those wheelie bins mate. 😊",
        "likes": 0,
        "published_at": "2026-01-29T23:53:54Z"
      },
      {
        "author": "@zsoltaranyi379",
        "text": "Oh kind of people has no job",
        "likes": 0,
        "published_at": "2026-01-29T22:49:28Z"
      },
      {
        "author": "@factchecker-r6z",
        "text": "Is this the new trailer for gta6?",
        "likes": 3,
        "published_at": "2026-01-29T23:23:04Z"
      },
      {
        "author": "@DjSolomon2025",
        "text": "He has been fitted as a target 🎯",
        "likes": 0,
        "published_at": "2026-01-29T22:57:32Z"
      },
      {
        "author": "@nycatsfamily1019",
        "text": "Wow",
        "likes": 0,
        "published_at": "2026-01-30T00:36:25Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:32.400541"
  },
  {
    "video_id": "RTvwzusKXPo",
    "title": "How drilling the 'Doomsday Glacier' could save our cities from climate crisis | Global News Podcast",
    "description": "British and South Korean scientists are drilling through the Thwaites glacier, in one of the most remote parts of Antarctica, to understand why and how it is melting. \n \nThwaites is in danger of collapsing due to climate change, and if that happens it could lead to higher global sea levels, and flooding in the world's biggest coastal cities.\n \nWe spoke to the BBC's climate editor, Justin Rowlatt - one of the few journalists to have visited the Thwaites glacier.\n \nSubscribe to the Global News Podcast wherever you get your podcasts or find more episodes here: https://bbc.in/GlobalNewsPodcast\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Thwaites #DoomsdayGlacier #BBCNews",
    "published_at": "2026-01-29T20:00:18Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT11M21S",
    "views": 11666,
    "likes": 248,
    "comments_count": 119,
    "comments": [
      {
        "author": "@attgor",
        "text": "Good to hear",
        "likes": 1,
        "published_at": "2026-01-30T05:18:31Z"
      },
      {
        "author": "@rebekahlittle2131",
        "text": "❤",
        "likes": 1,
        "published_at": "2026-01-29T22:32:01Z"
      },
      {
        "author": "@markae0",
        "text": "Have you dreamt of the world (planet) in dreams where it can be all green like it is all green jungle fungus, or the opposite the planet is all white ice?",
        "likes": 2,
        "published_at": "2026-01-29T22:18:21Z"
      },
      {
        "author": "@Mr.ActionReAction",
        "text": "Winter is coming....if Arctic fall and melt, impact on Europe and America directly",
        "likes": 0,
        "published_at": "2026-01-30T04:28:10Z"
      },
      {
        "author": "@galvanicmass",
        "text": "In other words, we&#39;re all kicking the bucket soon. 😊",
        "likes": 1,
        "published_at": "2026-01-29T22:31:11Z"
      },
      {
        "author": "@jefferyjimson8574",
        "text": "Some scientists say that 1.3°C global average temperatures is the tipping point where the Greenland ice sheet will continue melting even if there is the stopping of human greenhouse gas emissions (mainly CO2) which hold onto and trap heat in the atmosphere instead of heat leaving into space. Currently global average temperatures are at 1.5°C and is expected to rise to 2°C by 2050. \r<br>The ocean current in the Atlantic (the AMOC) has slowed by 30% over the last 150 years due to Greenland ice melting and the freshwater not being able to sink which drives the ocean currents. A drastic slow down is expected by 2050, and what the current does is it brings warm water which then warms the air from the equator northward up the Atlantic toward Greenland and this then meets the cold air coming down from the arctic: if the AMOC slows and warm air is not brought up then the cold air is not stopped and is free to come down over the northern hemisphere (North America, Europe, Northern Asia), and the freezing kills crops and kills the ecosystems in the soil which makes the soil fertile for crops.\r<br>As well without heat leaving the equator, it makes it hotter for the equator regions (South America, Africa), which increases drought which also kills crops and causes soil infertility.\r<br>1.2 billion people live in areas that could be displaced by climate effects before 2050.\r<br>Four of the top five contributors to climate change (China, USA, India, Europe+UK, Russia) are planning to double emissions by 2050.\r<br>~\r<br>Knowing creates duality (either or): this/that; here/there; then/now; good/bad; right/wrong.\r<br>Knowing creates the illusion/dream of separation of being separate from everything, which is symbolised in the bible by Adam and Eve eating from the tree of knowledge and being cast out of the garden of Eden. \r<br>The natural reality is that of non-duality and there just being everything already as it naturally is regardless of the experience of knowing (even though ‘this’ is identified there is also already as well ‘that’: it is not either or - both/ all exists already), and furthermore, without the need for knowing; again symbolised by Adam and Eve being naked – the naturality and they do not know they are naked.\r<br>This is also represented in Buddhism by nirvana/liberation: no need for knowing/ the sense of self which feels the need to know; and also in Hinduism with Moksha: the divine goddess Kali cuts off the head of the sense of self that believes it is separate from everything/ the divine. \r<br>Without need there is just absolute freedom.\r<br>~\r<br>Bentinho Massaro – Become a Manifestation Powerhouse \r<br>I want you to imagine what its like to never ever receive anything again. What would that be like, to not ever receive anything again. To not have the feeling, not have the sense, that you are at the receiving end of creation. Yes, you are perceiving creation, but are you really receiving creation? What if you are not receiving creation, what if that was never the case. What if 100% of the time, you put in place exactly the things that you see. All the time, every nano second. All the billions of molecules are placed there by you. What if you are not the receiver of experiences, but the conceiver, and the giver of experiences. What if it is you that is giving creation its creation, its form. What if you’re not a mind-body walking around in a predetermined physical external reality, what if all of this is your own manifestation. \r<br>Now this may not be a completely new concept, but what might be slightly new to you is the more radical approach of seeing the fact that you have never ever ever ever received anything to begin with, you have always given yourself this moment, you’ve always given/ you’ve always created/ you’ve always decided what this moment is going to appear as, what its going to look like, and you can therefore become conscious of that once again, instead of being an unconscious creator, that then believes it’s a receiver of its own creations which its unaware of, you can step back into the creator seat, and you can be conscious, you can become more deliberate; take the reins back up. This is not about control in that sense, although it is, as well, but not in the way that we have made it out to be in a negative concept, its about control in terms of conscious creation, you take control, in that sense you take control of yourself, you become more deliberate in your manifestations, in your creations, in what you place in front of you. Does that make sense so far as a general context to what I am sharing",
        "likes": 1,
        "published_at": "2026-01-30T08:08:01Z"
      },
      {
        "author": "@adrianlouw2499",
        "text": "Also a fun little exercise: look up your local weather report from 30 years ago today. What was that day like? So different I bet...",
        "likes": 2,
        "published_at": "2026-01-30T02:09:33Z"
      },
      {
        "author": "@bigtime4794",
        "text": "Least of my concerns",
        "likes": 1,
        "published_at": "2026-01-29T21:46:19Z"
      },
      {
        "author": "@OldScientist",
        "text": "The rate of loss from the Antarctic Ice sheet is not accelerating. There is no multi-decadal massive loss from the WAIS due to warming and basal melt. \r<br>West Antarctica and the Peninsula have not warmed this century. The Peninsula has cooled by -1.20°C per decade, and the greater part of West Antarctica including the majority of the coastal region has cooled by -0.54°C per decade. This is for 2003-2021 (Nielsen et al, 2025). If the surface isn&#39;t warming that will not increase melting. \r<br>Basal melt has not increased. There is no accelerated melting along the majority of the West Antarctic Pacific-facing margin. Of the 33 glacial basins only 7 showed an increased grounding line migration rate, with only one showing a significant change. Most showed no change. 7 showed a decrease in grounding line migration rate, with 4 showing a very high rate of decrease 2003-2015 (Christie et al, 2023). So no acceleration.  \r<br>I suppose this explains why the total mass loss has decline from 175Gt/yr in 2009 to 125Gt in 2015 (IMBIE WAIS). The latter is 0.006% of the total mass of the WAIS. And no acceleration. \r<br>If we are being generous that causes about 0.4mm a year (16 thousanths of an inch) of sea level rise. \r<br>Antarctica might give us 2cm SLR by 2100 (Coulon et al, 2024) and Greenland might give us 2cm by 2100 (Edwards et al, 2021). 4cm (a little more than an inch and a half) by the end of the century. So what?",
        "likes": 0,
        "published_at": "2026-01-30T08:42:30Z"
      },
      {
        "author": "@DeanHurley-g3q",
        "text": "To have a better connection to country it&#39;s important to take your shoes off, in the hottest days you feel the temperatures under your feet, walking on roads is the same as walking on embers next hottest is concrete then grass but the problems with this is if cut too short it exposes the dirt to the light heating the ground and kills the grass and dries up the ground stopping evaporative cooling allowing weeds like bindis to grow, then being on the grass is no escape from the heat but if you don&#39;t scalp the grass no weeds and keeps the ground cool with shade allowing by transpiration evaporative cooling from the plants instead of evaporation from the dirt, when you allow clover to grow in damaged soils it repairs it&#39;s fertility thus promoting the grass to grow better, but to achieve this cooling efficiency in suburbia and cities local councils and the greater public need to be educated , on the hottest days if you have thick grass the ground under your feet is cool under the shade of a tree after midday when it&#39;s most hottest , this effect happens best at about <a href=\"https://www.youtube.com/watch?v=RTvwzusKXPo&amp;t=90\">1:30</a> onwards, all them commercial lawn mowers are the least qualified to be in that vocation, at their own detriment they&#39;re reducing their own work loads pretending to cut grass already too short because they originally had cut it too short reducing the speed at which it grows back , , makes the dry ground reflect the noise , Australia&#39;s biggest problem is stupidity",
        "likes": 0,
        "published_at": "2026-01-30T04:44:54Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:32.668238"
  },
  {
    "video_id": "fVzrbBfzVBk",
    "title": "What could happen if the US strikes Iran? #Iran #US #BBCNews",
    "description": "",
    "published_at": "2026-01-29T19:00:43Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT1M27S",
    "views": 34338,
    "likes": 410,
    "comments_count": 125,
    "comments": [
      {
        "author": "@MrNeo-23",
        "text": "Yes..yes... same playbook...let&#39;s manufacture consent shall we, BBC",
        "likes": 31,
        "published_at": "2026-01-29T19:52:00Z"
      },
      {
        "author": "@Pixelbeau",
        "text": "I prefer the muppet show, its more accurate than bbc journalists.",
        "likes": 22,
        "published_at": "2026-01-29T19:59:49Z"
      },
      {
        "author": "@martinmcshane4487",
        "text": "Nothing, absolutely nothing",
        "likes": 16,
        "published_at": "2026-01-29T19:08:55Z"
      },
      {
        "author": "@Jim-mn7yq",
        "text": "Beware of experts . . .especially those with British accents,",
        "likes": 6,
        "published_at": "2026-01-29T21:26:10Z"
      },
      {
        "author": "@Voyager150",
        "text": "Predicting war is an act of madness, war by it’s nature is unpredictable.",
        "likes": 3,
        "published_at": "2026-01-29T23:19:10Z"
      },
      {
        "author": "@Isclachau",
        "text": "Err, 24 hours of BBC moaning about the man they lied about, Trump",
        "likes": 9,
        "published_at": "2026-01-29T20:31:54Z"
      },
      {
        "author": "@samcon777",
        "text": "What bs is he on",
        "likes": 7,
        "published_at": "2026-01-29T20:43:04Z"
      },
      {
        "author": "@zacidaxmad2394",
        "text": "Analysis that look like a dream which will not become true😂😂",
        "likes": 3,
        "published_at": "2026-01-29T21:54:40Z"
      },
      {
        "author": "@AvaMova",
        "text": "Fake news fake analysis",
        "likes": 13,
        "published_at": "2026-01-29T20:16:34Z"
      },
      {
        "author": "@MBeats27",
        "text": "Since when has bombing created democracy?",
        "likes": 4,
        "published_at": "2026-01-29T23:02:16Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:33.013484"
  },
  {
    "video_id": "9TCkrN16Hac",
    "title": "Polar bears on Norwegian islands fatter and healthier despite ice loss, scientists say | BBC News",
    "description": "Scientists expected the opposite, but polar bears in the Norwegian Arctic islands of Svalbard have become fatter and healthier since the early 1990s.\n\nPolar bears rely on sea ice, which is declining, as a platform from which to hunt the seals that they rely on for blubber-rich meals. \n\nThe bears' fat reserves provide energy and insulation and allow mothers to produce rich milk for cubs.\n\nResearchers think that Svalbard bears have adapted to recent ice loss by eating more land-based prey, including reindeer and walruses.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#PolarBears #Svalbard #BBCNews",
    "published_at": "2026-01-29T19:00:08Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT2M21S",
    "views": 12220,
    "likes": 262,
    "comments_count": 70,
    "comments": [
      {
        "author": "@solomonenos4632",
        "text": "Less ICE and more Ice!",
        "likes": 22,
        "published_at": "2026-01-29T19:45:36Z"
      },
      {
        "author": "@ronoc9",
        "text": "The only time a terrifying sentence is a good thing.",
        "likes": 7,
        "published_at": "2026-01-29T19:51:47Z"
      },
      {
        "author": "@SensenmaenchenXP",
        "text": "There is enough tasty humans around",
        "likes": 18,
        "published_at": "2026-01-29T19:21:24Z"
      },
      {
        "author": "@AdmiringBabyPenguin-on6fd",
        "text": "Aww they are so perfect.❤❤",
        "likes": 6,
        "published_at": "2026-01-29T22:04:16Z"
      },
      {
        "author": "@tonys1636",
        "text": "They&#39;ve worked out the bear necessities of life.",
        "likes": 2,
        "published_at": "2026-01-30T00:11:31Z"
      },
      {
        "author": "@returnGreateUkraina",
        "text": "So i don&#39;t understand ICE working in Arctic now?",
        "likes": 1,
        "published_at": "2026-01-29T22:55:40Z"
      },
      {
        "author": "@christinasophieschultz5081",
        "text": "Nature finds always a way. Except human stops it",
        "likes": 2,
        "published_at": "2026-01-29T21:50:13Z"
      },
      {
        "author": "@venus22118",
        "text": "I bet! There&#39;s less land mass to compete over - OBVS",
        "likes": 1,
        "published_at": "2026-01-29T22:58:30Z"
      },
      {
        "author": "@NoWindNoSunNoPower",
        "text": "I thought that they were extinct.",
        "likes": 0,
        "published_at": "2026-01-30T03:21:44Z"
      },
      {
        "author": "@richardmurphy9006",
        "text": "Well it ain&#39;t Grass",
        "likes": 0,
        "published_at": "2026-01-29T21:41:18Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:33.334715"
  },
  {
    "video_id": "ps_A0YpiEeQ",
    "title": "US border tsar Tom Homan says he has come to Minnesota to \"seek solutions\". #ICE #BBCNews",
    "description": "",
    "published_at": "2026-01-29T18:31:25Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT49S",
    "views": 14052,
    "likes": 114,
    "comments_count": 37,
    "comments": [
      {
        "author": "@rehanansari009",
        "text": "Nuremberg trails live on TV",
        "likes": 16,
        "published_at": "2026-01-29T19:32:01Z"
      },
      {
        "author": "@neilattuk",
        "text": "Do the “solutions” involve paper bags with dollars in them? Just asking….",
        "likes": 2,
        "published_at": "2026-01-29T22:41:55Z"
      },
      {
        "author": "@allysongrahamgriffiths7849",
        "text": "You came to clean up the mess that your branch of government has caused. We better not see you with a brown bag!",
        "likes": 11,
        "published_at": "2026-01-29T18:33:40Z"
      },
      {
        "author": "@ColinBarlow-g1j",
        "text": "50.000. Dollars. Let’s talk about that.",
        "likes": 3,
        "published_at": "2026-01-29T21:40:37Z"
      },
      {
        "author": "@pfrydog",
        "text": "Fake humbleness.",
        "likes": 14,
        "published_at": "2026-01-29T19:42:36Z"
      },
      {
        "author": "@12bigredd",
        "text": "lol what a total load of rubbish this man is going to carry on the same way",
        "likes": 3,
        "published_at": "2026-01-29T19:35:52Z"
      },
      {
        "author": "@BKT42",
        "text": "I&#39;m lying .",
        "likes": 2,
        "published_at": "2026-01-29T21:06:42Z"
      },
      {
        "author": "@Krisgenx",
        "text": "How about making your staff obey the law… That would be a good start",
        "likes": 1,
        "published_at": "2026-01-30T03:37:52Z"
      },
      {
        "author": "@laetitiazichy-vanlidth5882",
        "text": "Mouhahaaa Donald😂",
        "likes": 0,
        "published_at": "2026-01-29T19:12:02Z"
      },
      {
        "author": "@knight9806",
        "text": "Tom Homan 2028",
        "likes": 2,
        "published_at": "2026-01-29T21:24:29Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:33.637349"
  },
  {
    "video_id": "Ut3zbcX-OsY",
    "title": "What does China get out of the UK prime minister's visit? | BBC Newscast",
    "description": "UK Prime Minister Sir Keir Starmer has been meeting with President Xi Jinping in Beijing, the first time a sitting British PM has visited China in eight years. Although a host of trade deals were announced, including visa free entry for UK travellers, there have been fewer agreements than expected from the trip.\n\nAdam is joined in studio by BBC deputy economics editor, Darshini David to chat about what we know so far and China correspondent, Laura Bicker who explains how the visit has been received in China.\n\nChris Mason also phones in to share his experience of being on the road with the PM and how the visit has gone down with MPs back home.\n\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\n\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\n\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\n\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews #china #starmer #xijinping",
    "published_at": "2026-01-29T18:00:37Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "world",
      "china",
      "xi jinping",
      "keir starmer",
      "uk news"
    ],
    "category_id": "25",
    "duration": "PT33M6S",
    "views": 20495,
    "likes": 252,
    "comments_count": 263,
    "comments": [
      {
        "author": "@Rennie-g5r",
        "text": "&quot;What does CHINA get out of Starmer&#39;s visit&quot;? Are you serious? It was Starmer that went to China with his begging bowl.",
        "likes": 45,
        "published_at": "2026-01-29T19:19:17Z"
      },
      {
        "author": "@noon8681",
        "text": "Stopped watching as soon as this dude threw in a remark about Hong Kong and the Uighurs, as if he knows jack shite lmao",
        "likes": 108,
        "published_at": "2026-01-29T18:16:02Z"
      },
      {
        "author": "@WilliamYuen-p1f",
        "text": "Can you imagine a host talking about China has never been to China? It begs the question how much understanding he has about China, politically and economically. His sarcastic remarks about human rights in China and Jimmy Lai in HK demonstrate his biased views and ignorance.<br><br>Laura on the other hand gives more accurate and unbiased views on China.",
        "likes": 21,
        "published_at": "2026-01-29T20:55:25Z"
      },
      {
        "author": "@HDsharp",
        "text": "UK, take what you can! from China, you&#39;re not in any position to be picky. UK needs this move not China 😅",
        "likes": 21,
        "published_at": "2026-01-29T20:12:06Z"
      },
      {
        "author": "@GordonDalglish",
        "text": "Wasn’t this the same Keir Starmer who was pretending to care about human rights in Iran? How strange.",
        "likes": 27,
        "published_at": "2026-01-29T18:07:15Z"
      },
      {
        "author": "@NativeAuslander",
        "text": "I think we just need to accept China for what it is and not what we want it to be, if the chinese people truly want democracy then THEY will be the ones to make it happen, not us.<br><br>We aren&#39;t the world police and we need to be pragmatic not preaching, trade not tirades. the US is in major decline and is imploding socially and politically, we need to decouple and hedge our bets.<br><br>The US-China superpower rivalry is not our problem and China doesn&#39;t have to be our enemy, american problems are not our problems and we would be beyond foolish to let ourselves get dragged into any kind of comflict with them.",
        "likes": 61,
        "published_at": "2026-01-29T18:09:53Z"
      },
      {
        "author": "@richardmarsden5610",
        "text": "China is at a higher level of civilisation advancement than the regressive West.",
        "likes": 15,
        "published_at": "2026-01-29T22:51:23Z"
      },
      {
        "author": "@akbarmohammed4eva",
        "text": "Funny BBC keeps parroting &quot;human rights&quot;, when the UK supported USA helping Israel to commit Genocide in Gaza.",
        "likes": 23,
        "published_at": "2026-01-29T18:47:45Z"
      },
      {
        "author": "@tonymcadam8362",
        "text": "Alternative title -  &quot;What does the UK prime minister get out of visit to China?&quot;",
        "likes": 7,
        "published_at": "2026-01-29T18:10:48Z"
      },
      {
        "author": "@georgedhand",
        "text": "What stupid contraption was Adam wearing whilst talking to Chris",
        "likes": 2,
        "published_at": "2026-01-30T00:54:25Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:33.900828"
  },
  {
    "video_id": "YNxMcntNoRE",
    "title": "What does the debate over censoring content on TikTok tell us about the US? #TikTok #US #BBCNews",
    "description": "",
    "published_at": "2026-01-29T17:01:02Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT1M20S",
    "views": 5231,
    "likes": 71,
    "comments_count": 5,
    "comments": [
      {
        "author": "@35saimk",
        "text": "And they were complaining Chinese censorship such hypocrites",
        "likes": 2,
        "published_at": "2026-01-29T17:54:19Z"
      },
      {
        "author": "@ankitachaudary9853",
        "text": "😂😂",
        "likes": 0,
        "published_at": "2026-01-29T19:58:31Z"
      },
      {
        "author": "@DeepakRaj-h6z5v",
        "text": "Leave the United States immediately and seek refuge in gaza, this is the only option for the safety of your children.",
        "likes": 0,
        "published_at": "2026-01-29T17:57:55Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:34.175027"
  },
  {
    "video_id": "592FsNMA830",
    "title": "Trump's border tsar suggests possible drawdown in Minneapolis | BBC News",
    "description": "US President Donald Trump's \"border tsar\" Tom Homan has said he is working on making ICE (Immigration and Customs Enforcement) operations in Minneapolis \"safer, more efficient, by the book\".\n\nIn a news conference that was light on details, he says he wants \"common sense co-operation that allows us to draw down on the number of people we have here\".\n\nHe says ICE and Border Patrol officers are working in a \"challenging environment\", but insists unprofessional behaviour will \"be dealt with\".\n\nPresident Trump sent Homan to the city to replace US Border Patrol chief Greg Bovino, after two protesters, Renee Good and Alex Pretti, were shot dead by federal officials in Minneapolis.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Minneapolis #Minnesota #DonaldTrump #BBCNews",
    "published_at": "2026-01-29T16:48:04Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT5M16S",
    "views": 50722,
    "likes": 346,
    "comments_count": 301,
    "comments": [
      {
        "author": "@rokloknita9494",
        "text": "These people never take accountability. Always deny and blame everyone else. DISGUSTING!",
        "likes": 47,
        "published_at": "2026-01-29T16:53:36Z"
      },
      {
        "author": "@FinarfinNoldorin",
        "text": "How about turning over the shooters to stand trial.",
        "likes": 74,
        "published_at": "2026-01-29T16:50:14Z"
      },
      {
        "author": "@embw1811",
        "text": "How about returning the money you took 😂😂",
        "likes": 13,
        "published_at": "2026-01-29T17:13:38Z"
      },
      {
        "author": "@SgtCake101",
        "text": "why is he called a &quot;tsar&quot; ?? do americans even know what that term means??",
        "likes": 13,
        "published_at": "2026-01-29T17:19:35Z"
      },
      {
        "author": "@MxyzPi",
        "text": "They&#39;re not needed.<br>Tom Homan says Minneapolis is going to be safer, more efficient, by the book&quot;; which implicitly means that it has, up to now, been unsafe inefficient and completely off book. <br>ICE can make Minneapolis saver by leaving it.",
        "likes": 31,
        "published_at": "2026-01-29T16:49:47Z"
      },
      {
        "author": "@tarathompson6768",
        "text": "NO, MOST AMERICANS DO NOT AGREE WITH YOU ON WHAT THEY ARE SEEING WITH EVERY ASPECT OF THE GOVERNMENT",
        "likes": 23,
        "published_at": "2026-01-29T16:53:21Z"
      },
      {
        "author": "@3rdcoastcopwatch",
        "text": "Where&#39;s Homan&#39;s bribe tape?",
        "likes": 28,
        "published_at": "2026-01-29T16:51:33Z"
      },
      {
        "author": "@Jellybeam1975",
        "text": "this guy will be even worse than Noem",
        "likes": 16,
        "published_at": "2026-01-29T16:51:56Z"
      },
      {
        "author": "@ElmoNeedsAnotherBeer",
        "text": "Homan looks like what a opened can of spam would look like if you left it out for a few days 😂",
        "likes": 19,
        "published_at": "2026-01-29T16:51:32Z"
      },
      {
        "author": "@dianeglanville",
        "text": "this will look like our country if tories rejects reform get in god help us",
        "likes": 15,
        "published_at": "2026-01-29T16:54:58Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:34.484154"
  },
  {
    "video_id": "AnN6hMUAG5k",
    "title": "Fancy living on an island for free? You can - if you're happy to count puffins. #Puffins #BBCNews",
    "description": "",
    "published_at": "2026-01-29T15:57:14Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT48S",
    "views": 13906,
    "likes": 282,
    "comments_count": 36,
    "comments": [
      {
        "author": "@aamahnievogel9431",
        "text": "Happy to count puffins! Count me in this amazing journey!",
        "likes": 10,
        "published_at": "2026-01-29T16:03:20Z"
      },
      {
        "author": "@tereisamullins2629",
        "text": "Wow....that&#39;s awesome",
        "likes": 2,
        "published_at": "2026-01-29T16:14:36Z"
      },
      {
        "author": "@ahseaton8353",
        "text": "How do you tell the puffins apart?",
        "likes": 0,
        "published_at": "2026-01-30T05:24:29Z"
      },
      {
        "author": "@soton5teve",
        "text": "Just live off grid - paddy&#39;s bushcraft, polissya bushcraft, nomad sam. Rather than entering a lottery",
        "likes": 2,
        "published_at": "2026-01-29T17:55:29Z"
      },
      {
        "author": "@Barewolf42",
        "text": "How many meals?!",
        "likes": 0,
        "published_at": "2026-01-29T21:48:06Z"
      },
      {
        "author": "@Altair_1502",
        "text": "How do we apply for it?",
        "likes": 3,
        "published_at": "2026-01-29T16:58:14Z"
      },
      {
        "author": "@ClearyMcDoo",
        "text": "Do you get 8 discs and a luxury though?",
        "likes": 0,
        "published_at": "2026-01-30T07:49:55Z"
      },
      {
        "author": "@nvmtt",
        "text": "Yeah no, i dont trust myself to not try and adopt one 😂",
        "likes": 0,
        "published_at": "2026-01-29T17:20:12Z"
      },
      {
        "author": "@ashisvnn.s4353",
        "text": "Somebody already counted 😅😅 you just tell the no.<br><br>Date ask what you do.😂😂 Count puffins😅😅",
        "likes": 0,
        "published_at": "2026-01-30T05:32:42Z"
      },
      {
        "author": "@Iwo2485",
        "text": "Four meals??",
        "likes": 0,
        "published_at": "2026-01-29T18:49:25Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:34.758956"
  },
  {
    "video_id": "CJ1RL7xFUWM",
    "title": "Why is there a TikTok censorship debate? | The Global Story Podcast",
    "description": "TikTok users in the US have claimed that the social media platform has been censoring content critical of the Trump administration.\n\nFollowing the fatal shooting of intensive care nurse Alex Pretti, in Minnesota, users reported that they couldn’t upload or view videos related to Immigration and Customs Enforcement, otherwise known as ICE.\n\nThe Department of Homeland Security says federal agents fired in self-defence.\n\nTikTok disputes that functionality issues were political, attributing them instead to data centre outages.\n\nThe controversy has exposed how a divided America is reacting to the shooting. \n\nAsma Khalid speaks to BBC Social Media Investigations Senior Correspondent Marianna Spring.\n\nNew episodes of The Global Story are released daily. If you’re in the UK, listen on BBC Sounds. If you live outside the UK, listen on BBC.com or wherever you get your podcasts. \n\nhttps://app.magellan.ai/listen_links/the-global-story-ytl\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news\n\n#BBCNews #tiktok #minneapolis #minnesota #trump \n\nChapters:\n00:00 The censorship debate explained\n01:20 The sale of TikTok\n04:20 What is the new entity of TikTok?\n05:50 Was it a Trump backed deal?\n07:13 When did users start noticing a problem?\n08:50 TikTok's response\n10:50 What happened to Alex Pretti?\n12:03 Celebrities delete TikTok\n13:30 How is Gavin Newsom involved?\n17:00 Is this criticism coming from the left?\n21:37 Closing thoughts",
    "published_at": "2026-01-29T15:23:01Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news",
      "trump",
      "TikTok",
      "censorship",
      "alexpretti",
      "Minnesota",
      "Minneapolis"
    ],
    "category_id": "25",
    "duration": "PT24M22S",
    "views": 6175,
    "likes": 106,
    "comments_count": 77,
    "comments": [
      {
        "author": "@smt4148",
        "text": "Yup - any post that says Epstein is instantly declined for posting",
        "likes": 10,
        "published_at": "2026-01-29T16:23:31Z"
      },
      {
        "author": "@SGC90-t5y",
        "text": "Skimming over the Larry Ellison influence...<br>Nothing to see here.",
        "likes": 6,
        "published_at": "2026-01-29T16:40:09Z"
      },
      {
        "author": "@notjustforhackers4252",
        "text": "Luckily here in the UK we are signed up to the ECHR and are very stringent about following its rules. Thankfully Article 10 protects against censorship of this kind. <br><br>Isn&#39;t that right BBC?",
        "likes": 12,
        "published_at": "2026-01-29T15:48:20Z"
      },
      {
        "author": "@tracyward3673",
        "text": "there is no debate about it.  they are no longer trusted and people are fleeing.",
        "likes": 4,
        "published_at": "2026-01-29T21:00:12Z"
      },
      {
        "author": "@SoapOfTheMactavish",
        "text": "Already very suspicious when TikTok managed to get their way back into the US. Now it’s just going to be another Truth Social.",
        "likes": 18,
        "published_at": "2026-01-29T15:28:11Z"
      },
      {
        "author": "@nevillekemp-iq4yy",
        "text": "It is kind of ominous that Elon Musk took Twitter and Oracle took TikTok.",
        "likes": 4,
        "published_at": "2026-01-29T16:56:23Z"
      },
      {
        "author": "@Catherine-ur1xp",
        "text": "We expected that they would, censorship and propaganda are the main weapons of a dictatorship!   They don’t care about pornographers or national security, but they Do care about controlling the narrative?",
        "likes": 5,
        "published_at": "2026-01-29T15:50:47Z"
      },
      {
        "author": "@deeaaytee5453",
        "text": "Corrupt Corporate actors in america are pushing control of social media platforms and news media to push propaganda and stop criticism of governments.<br>You can&#39;t trust any platform anymore.",
        "likes": 5,
        "published_at": "2026-01-29T15:54:13Z"
      },
      {
        "author": "@SanjuPun-t8y",
        "text": "Pro Israeli conservative MAGA Oracle and TikTok owner Larry Ellison is also censoring anti Israel critics and patriots on TikTok on behalf of a foreign country conservative MAGA Israel. Larry Ellison have connection with conservative MAGA Benjamin Netanyahu. Benjamin Netanyahu and conservative MAGA Israeli lobbies have seeked helped from Larry Ellison, Elon Musk and from Mark Zuckerberg to censor pro Palestinian activists and anti Israel critics. Anti Israel algorithms are also getting censored which Netanyahu admitted it. There&#39;s video evidences to prove.",
        "likes": 6,
        "published_at": "2026-01-29T16:09:25Z"
      },
      {
        "author": "@banannablysmartactor7054",
        "text": "usa now a dictatorship, the new american dream , 😂😂😂",
        "likes": 7,
        "published_at": "2026-01-29T15:30:15Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:35.004909"
  },
  {
    "video_id": "kYHHg6oV8A4",
    "title": "'Worst floods in a generation' sweep Mozambique | BBC News",
    "description": "There have been rescue efforts for tens of thousands of people in Mozambique as rising waters have continued to devastate the southern African nation - the worst flooding in a generation.\n\nTeams from Brazil, South Africa and the UK have been helping with life-saving rescue operations.\n\nAlmost 700,000 people have been affected since 7 January by flooding - particularly in southern and central regions, with more than 100 deaths and others are still missing.\n\nSubscribe here: http://bit.ly/1rbfUog \n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Mozambique #Floods #BBCNews",
    "published_at": "2026-01-29T12:45:32Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT2M39S",
    "views": 10175,
    "likes": 156,
    "comments_count": 48,
    "comments": [
      {
        "author": "@sLABELtv",
        "text": "Horrible tragedy",
        "likes": 2,
        "published_at": "2026-01-29T20:53:18Z"
      },
      {
        "author": "@Mixedbeats18",
        "text": "Well over there 3/4 of the time of year are hot and dry, the rain weather when arrives, arrives with strenght",
        "likes": 0,
        "published_at": "2026-01-29T12:54:08Z"
      },
      {
        "author": "@Akai_28",
        "text": "I have never heard of Floods and storms in January Spain and now Mozam🥶🥶🥶🥶🥶🤨🤨🤨🤨🤨🤨🤨😲😲😲😲",
        "likes": 2,
        "published_at": "2026-01-30T02:29:38Z"
      },
      {
        "author": "@gracemitchell8891",
        "text": "It’s about time this was brought to the worlds attention <br>It is a complete disaster",
        "likes": 1,
        "published_at": "2026-01-30T05:43:40Z"
      },
      {
        "author": "@Wompwomplilbro69420",
        "text": "MOZAMBIQUE HERE",
        "likes": 2,
        "published_at": "2026-01-29T13:23:21Z"
      },
      {
        "author": "@mrakronyahoo",
        "text": "Nothing to do with climate change. Its normal to have record-breaking floods",
        "likes": 4,
        "published_at": "2026-01-29T13:26:10Z"
      },
      {
        "author": "@shaf60",
        "text": "This is all part of the sixth mass extinction which is well on its way, cause humans.   🌍",
        "likes": 2,
        "published_at": "2026-01-29T17:41:23Z"
      },
      {
        "author": "@RobertWalls-x6x",
        "text": "Probably not even true as it’s the BBC…🤥",
        "likes": 0,
        "published_at": "2026-01-30T08:25:27Z"
      },
      {
        "author": "@wildandbarefoot",
        "text": "MOZAMBIQUE: the flag has an AK-47 on it. <br>Jog on.",
        "likes": 1,
        "published_at": "2026-01-29T15:41:33Z"
      },
      {
        "author": "@lemcakes32422",
        "text": "whats amazing about most african countries is they are safer than usa lol",
        "likes": 0,
        "published_at": "2026-01-29T14:29:26Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:35.261270"
  },
  {
    "video_id": "3HA7by8mQtU",
    "title": "UK PM Keir Starmer meets Chinese President Xi Jinping | BBC News",
    "description": "UK Prime Minister Keir Starmer has said the country's relationship with China is in a \"good, strong place\" after \"productive\" talks with Chinese leader Xi Jinping in Beijing.\n\nStarmer added that progress has been made on issues including whisky tariffs and visa-free travel to China, with No 10 saying the two countries will \"maintain frank and open dialogue on areas of disagreement\".\n\nXi said there have been \"twists and turns\" in China-UK ties, but engagement is \"unavoidable\", while pharmaceutical firm AstraZeneca, headquartered in the UK, has announced a $15bn investment in China.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#China #UK #BBCNews",
    "published_at": "2026-01-29T11:14:44Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT9M51S",
    "views": 167528,
    "likes": 1708,
    "comments_count": 1881,
    "comments": [
      {
        "author": "@josephdiao8149",
        "text": "It’s literall, LITERALLY 2026, and BBC is still murmuring Chinese human rights issue…..",
        "likes": 411,
        "published_at": "2026-01-29T14:05:22Z"
      },
      {
        "author": "@TCOZJH",
        "text": "如果你问任何一个中国人，他们都会认为少数民族享受了太多特权，而不是缺乏人权🤣",
        "likes": 219,
        "published_at": "2026-01-29T15:31:12Z"
      },
      {
        "author": "@Paul_in_Thailand",
        "text": "Human rights?  Starmer isn&#39;t in a position to lecture on that is he.",
        "likes": 558,
        "published_at": "2026-01-29T12:02:21Z"
      },
      {
        "author": "@panphan6455",
        "text": "Two hundred years have passed; who is threatening whom?",
        "likes": 205,
        "published_at": "2026-01-29T12:20:46Z"
      },
      {
        "author": "@xgx-q4l",
        "text": "你们除了人权能讲出第二个词吗？你真那么关心的话美国警察当街杀人算不算侵犯人权？",
        "likes": 31,
        "published_at": "2026-01-29T17:36:24Z"
      },
      {
        "author": "@anomanderrake96",
        "text": "Hahaha, after claiming China is the enemy the Brits go with a begging bowl.",
        "likes": 197,
        "published_at": "2026-01-29T12:53:20Z"
      },
      {
        "author": "@Globe-m6z",
        "text": "The woman anchor said &#39;We know China is a global power&#39; rather grudgingly😂. China is not some global power. It is the new global superpower.",
        "likes": 185,
        "published_at": "2026-01-29T12:35:39Z"
      },
      {
        "author": "@kevinjones6610",
        "text": "Can they pls keep him😂😂😂😂😂😂😂",
        "likes": 184,
        "published_at": "2026-01-29T12:02:58Z"
      },
      {
        "author": "@Toothfairlyinthe",
        "text": "I hope the Chinese government is suspicious of all the European leaders that are suddenly making daily visits to them.",
        "likes": 55,
        "published_at": "2026-01-29T15:54:51Z"
      },
      {
        "author": "@azmalkhan01",
        "text": "British Media is always focus on human rights issues in other country but never razor issue of abuses in UK itself example you will be jailed or arrested if you speak against killings in Palestine<br>on other hand if you are pro Israel and call for killing of Palestinian police will not do anything. hundreds of people get arrested or worn by police what they say over the internet",
        "likes": 220,
        "published_at": "2026-01-29T12:50:05Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:35.662482"
  },
  {
    "video_id": "9izPgSqxfLs",
    "title": "What is it like filming intimate scenes on Bridgerton? #LukeThompson #YerinHa #Bridgerton #BBCNews",
    "description": "",
    "published_at": "2026-01-29T10:20:00Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT55S",
    "views": 10333,
    "likes": 91,
    "comments_count": 1,
    "comments": [],
    "fetched_at": "2026-01-30T14:46:35.906124"
  },
  {
    "video_id": "70VIhYkn7U0",
    "title": "There were \"real concrete outcomes\" after the talks in Beijing, the UK PM said. #China #BBCNews",
    "description": "",
    "published_at": "2026-01-29T09:20:36Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT16S",
    "views": 24592,
    "likes": 271,
    "comments_count": 93,
    "comments": [
      {
        "author": "@一鸣-s5w",
        "text": "bbc不应该说一声那么代价是什么呢",
        "likes": 5,
        "published_at": "2026-01-29T12:57:37Z"
      },
      {
        "author": "@SemperSupra8",
        "text": "&quot;You wack the armada and we&#39;ll say we&#39;re not getting involved &quot;",
        "likes": 3,
        "published_at": "2026-01-29T12:29:47Z"
      },
      {
        "author": "@RalphBrooker-gn9iv",
        "text": "Jeez. Starmer is crap at the stare off!",
        "likes": 4,
        "published_at": "2026-01-29T09:54:42Z"
      },
      {
        "author": "@darthvadeth6290",
        "text": "&quot;But at what cost???&quot; 😂 😂 😂",
        "likes": 2,
        "published_at": "2026-01-29T17:40:04Z"
      },
      {
        "author": "@TecOneself",
        "text": "Good news!!",
        "likes": 4,
        "published_at": "2026-01-29T09:39:19Z"
      },
      {
        "author": "@maykolee",
        "text": "2tk vs she jumping 🤣🤣🤣🤣🤣",
        "likes": 0,
        "published_at": "2026-01-29T09:26:42Z"
      },
      {
        "author": "@francophone.",
        "text": "Asking for advice on population control?",
        "likes": 2,
        "published_at": "2026-01-29T10:35:15Z"
      },
      {
        "author": "@Ricky-Boby83",
        "text": "Trump did this.",
        "likes": 3,
        "published_at": "2026-01-29T14:31:27Z"
      },
      {
        "author": "@cliffordhughes2128",
        "text": "Do you know where i can by a rubber dinghy 😂 yes keir how many do you want",
        "likes": 0,
        "published_at": "2026-01-29T18:02:24Z"
      },
      {
        "author": "@deedee4531",
        "text": "What part of the country is he selling of now",
        "likes": 3,
        "published_at": "2026-01-29T10:51:07Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:36.162942"
  },
  {
    "video_id": "MOMXJvbCEtk",
    "title": "Analysing the Minneapolis shooting of Alex Pretti | BBC News",
    "description": "Bystander footage captured the moments before the killing of 37-year-old Minneapolis man Alex Pretti by federal immigration officers.\n \nHis death on Saturday happened less than three weeks after Renee Good was shot dead by an immigration agent in the city.\n \nBBC Verify has analysed footage of the shooting from multiple angles, piecing together a detailed picture of what happened.\n \nRos Atkins' report contains distressing images.\n \nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
    "published_at": "2026-01-28T23:42:52Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT8M42S",
    "views": 63027,
    "likes": 1310,
    "comments_count": 866,
    "comments": [
      {
        "author": "@sterlingls7112",
        "text": "If the US government can lie blatantly like this when there’s video evidence imagine what other things they lie about",
        "likes": 207,
        "published_at": "2026-01-29T01:04:16Z"
      },
      {
        "author": "@stephenlosch2015",
        "text": "Who is the person that fired first, then came back for more? Where is he? Where are the charges? Disposition? Suspension subject to investigation?",
        "likes": 157,
        "published_at": "2026-01-28T23:55:42Z"
      },
      {
        "author": "@ilovelimpfries",
        "text": "They think we are blind.",
        "likes": 122,
        "published_at": "2026-01-28T23:55:29Z"
      },
      {
        "author": "@limitgoesoff",
        "text": "This doesn&#39;t change anything about what happened to him in the slightest.",
        "likes": 49,
        "published_at": "2026-01-29T06:19:00Z"
      },
      {
        "author": "@johnculbreth4543",
        "text": "This was more than Murder, it was an assassination .",
        "likes": 103,
        "published_at": "2026-01-29T00:08:45Z"
      },
      {
        "author": "@jdsstan",
        "text": "Carrying a gun is legal in Minnesota. Murder is not.",
        "likes": 72,
        "published_at": "2026-01-28T23:55:22Z"
      },
      {
        "author": "@nedgey",
        "text": "Thank you BBC. This is an important video. Americans, change your government. ICE agents responsible should get life in prison.",
        "likes": 106,
        "published_at": "2026-01-29T00:06:09Z"
      },
      {
        "author": "@Abtsi",
        "text": "I heartbroken and can’t believe this happened to Mr. Pretti and his family.<br><br>However, this video speaks for itself. No matter what had happened and what side you are with. Either you are with the President of the United States or with the citizens of the United States. The whole world will judge it by their eyes.<br><br>Hope justice comes soon for the Pretti family.",
        "likes": 47,
        "published_at": "2026-01-29T01:03:14Z"
      },
      {
        "author": "@richardm4825",
        "text": "How many times does this need to be shown? The man was murdered with a shot in the back of the head by a coward.",
        "likes": 99,
        "published_at": "2026-01-29T00:03:41Z"
      },
      {
        "author": "@JamieReno",
        "text": "Murder.",
        "likes": 101,
        "published_at": "2026-01-28T23:51:59Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:36.435141"
  },
  {
    "video_id": "ikRBVNw4tZU",
    "title": "Trump warns Iran “massive armada” on way and time running out for nuclear deal | BBC News",
    "description": "Donald Trump has warned Iran that \"time is running out\" to negotiate a deal on its nuclear programme following the build-up of US military forces in the Gulf.\n\nThe US president said a \"massive Armada\" was \"moving quickly, with great power, enthusiasm, and purpose\" towards Iran, referring to a large US naval fleet.\n\nIn response, Iran's Foreign Minister Abbas Araghchi said the country's armed forces were ready \"with their fingers on the trigger\" to \"immediately and powerfully respond\" to any aggression by land or sea.\n\nIran insists its nuclear programme is entirely peaceful and has repeatedly denied accusations by the US and its allies that it is seeking to develop nuclear weapons.\n\nTrump's latest warning follows his promise that Washington would intervene to help those involved in the brutal and unprecedented crackdown on protests in the country earlier this month.\n\nThe US-based Human Rights Activists News Agency (HRANA) says it has confirmed the killing of more than 6,301 people, including 5,925 protesters, since the unrest began at the end of December.  HRANA says it is also investigating another 17,000 reported deaths received despite an internet shutdown after nearly three weeks.  \n\nAnother group, the Norway-based Iran Human Rights (IHR), has warned that the final toll could exceed 25,000.\n\nReeta Chakrabarti presents BBC News at Ten reporting by Caroline Hawley and Sarah Smith.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
    "published_at": "2026-01-28T22:45:16Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "news",
      "world",
      "america",
      "usa",
      "Iran",
      "Trump",
      "warning",
      "massive",
      "armada",
      "nuclear",
      "programme",
      "time",
      "running",
      "out",
      "attack",
      "airstrikes",
      "crisis",
      "economic",
      "economy",
      "protests",
      "streets",
      "demonstrations",
      "demonstrators",
      "protesters",
      "protestors",
      "Tehran",
      "death",
      "dictator",
      "Shah",
      "strikes",
      "Bazaar",
      "spread",
      "cities",
      "inflation",
      "currency",
      "devaluation",
      "dollar",
      "rial",
      "energy",
      "sanctions",
      "Israel",
      "Gaza",
      "US",
      "United",
      "States",
      "war",
      "threat",
      "risk",
      "danger",
      "Lebanon",
      "Netanyahu",
      "Ayatollah",
      "Khamenei",
      "Putin",
      "India",
      "China",
      "Russia",
      "democracy",
      "Modi",
      "Xi",
      "weapon",
      "strike",
      "Saudi",
      "UAE",
      "breaking",
      "USA",
      "warns"
    ],
    "category_id": "25",
    "duration": "PT4M46S",
    "views": 214375,
    "likes": 1220,
    "comments_count": 1427,
    "comments": [
      {
        "author": "@khandakernomanfahim1484",
        "text": "I thought those bombers already destroyed the nuclear facility in Iran.",
        "likes": 82,
        "published_at": "2026-01-29T00:18:59Z"
      },
      {
        "author": "@Complicitur",
        "text": "Everything for AIPAC, LFI, IAC but not for America 😂😂😂",
        "likes": 22,
        "published_at": "2026-01-29T00:52:25Z"
      },
      {
        "author": "@pi5549",
        "text": "Those EPSTEIN FILES must be <i>really</i> bad, huh?",
        "likes": 86,
        "published_at": "2026-01-29T06:08:29Z"
      },
      {
        "author": "@darrenjamrock2677",
        "text": "Why would Iran arrange a nuclear deal with Trump, when in 2018 he withdrew from Iran&#39;s nuclear arrangement and last year he used a nuclear deal as a distraction for Israel to attack Iran.",
        "likes": 143,
        "published_at": "2026-01-29T00:03:38Z"
      },
      {
        "author": "@morlaiC",
        "text": "The propaganda is in full gear, the WMD playbook back in action with the media talking up the narrative.",
        "likes": 54,
        "published_at": "2026-01-28T23:48:47Z"
      },
      {
        "author": "@goldenserenity2385",
        "text": "These propaganda pieces are presented in the exact same way they were 10 / 15 / 20 / 30 years ago 😂 who is buying this",
        "likes": 126,
        "published_at": "2026-01-28T23:38:10Z"
      },
      {
        "author": "@Majirto",
        "text": "Same Armada that ran away from Afghanistan leaving all their equipment 😂😂😂😂",
        "likes": 86,
        "published_at": "2026-01-29T00:27:16Z"
      },
      {
        "author": "@TheWhiteEagle-b7p",
        "text": "Iran is not Venezuela 😂😂😂..and Greenland is NOT Iceland",
        "likes": 117,
        "published_at": "2026-01-28T23:27:46Z"
      },
      {
        "author": "@neilgraves5069",
        "text": "There is far too many loonies in power . God Help us",
        "likes": 58,
        "published_at": "2026-01-28T23:18:50Z"
      },
      {
        "author": "@ElitistMagi",
        "text": "How kind of you to leave out the Iranian civilian casualties numbering more than a thousand that Israel murdered and bombed during the attack!",
        "likes": 40,
        "published_at": "2026-01-28T23:53:16Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:36.839328"
  },
  {
    "video_id": "Bd-MOD8zLrw",
    "title": "US President Trump says he 'loves' Nicki Minaj's nails. #NickiMinaj #BBCNews",
    "description": "",
    "published_at": "2026-01-28T22:13:28Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT51S",
    "views": 35321,
    "likes": 419,
    "comments_count": 95,
    "comments": [
      {
        "author": "@Hairs7",
        "text": "Not one brain cell between the two of them.",
        "likes": 27,
        "published_at": "2026-01-29T10:17:29Z"
      },
      {
        "author": "@windsorblue4852",
        "text": "Wtf is wrong with the USA man",
        "likes": 105,
        "published_at": "2026-01-28T22:24:10Z"
      },
      {
        "author": "@nieko3038",
        "text": "US is as fake as it gets.<br>Even the eagle scream is fake.",
        "likes": 22,
        "published_at": "2026-01-29T07:43:37Z"
      },
      {
        "author": "@fabianofilipet7110",
        "text": "Daily reminder: STOP idolizing celebs. They  D-O  N-O-T  C-A-R-E about anything other than their money or fame, or YOU. Give them money in a responsible way. Also listen to those who aren’t as trash as Niki Minaj.",
        "likes": 20,
        "published_at": "2026-01-29T07:34:42Z"
      },
      {
        "author": "@catk9007",
        "text": "Money money money that&#39;s all he cares about",
        "likes": 12,
        "published_at": "2026-01-29T06:29:28Z"
      },
      {
        "author": "@Elias_3ps",
        "text": "Thanks GOD Nicki got clothes on 😂",
        "likes": 13,
        "published_at": "2026-01-29T07:49:02Z"
      },
      {
        "author": "@patelhuni2106",
        "text": "poor simpleton😂😂😂😂",
        "likes": 18,
        "published_at": "2026-01-29T03:06:22Z"
      },
      {
        "author": "@patelhuni2106",
        "text": "Clown 🤡🤡🤡🤡🤡🤡",
        "likes": 13,
        "published_at": "2026-01-29T03:05:28Z"
      },
      {
        "author": "@diannehinds6353",
        "text": "I’m suddenly not a fan of her anymore, and of course let’s address the most important thing… her nails.. WTF",
        "likes": 23,
        "published_at": "2026-01-29T00:51:03Z"
      },
      {
        "author": "@Unitedsgreatest",
        "text": "I think nikki wants or has done something terrible. Cause this direction change makes no sense. Especially with trumps recent exploits.",
        "likes": 7,
        "published_at": "2026-01-29T03:10:11Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:37.085021"
  },
  {
    "video_id": "KAFDaed-lLk",
    "title": "Ecuador says ICE tried to enter its Minneapolis consulate. #ICE #BBCNews",
    "description": "#BBCNews",
    "published_at": "2026-01-28T20:30:04Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT1M12S",
    "views": 38284,
    "likes": 1026,
    "comments_count": 120,
    "comments": [
      {
        "author": "@JohnDoe-tx8lq",
        "text": "They really do have ZERO TRAINING!!!",
        "likes": 119,
        "published_at": "2026-01-28T22:12:08Z"
      },
      {
        "author": "@jeanponton5669",
        "text": "A consulate is foreign property.  These ICE people are clueless.  They trying to start an international incident?",
        "likes": 97,
        "published_at": "2026-01-28T22:36:44Z"
      },
      {
        "author": "@SanSel-n9d",
        "text": "ICE agents are untrained thugs. They usually do not know what they are doing.",
        "likes": 103,
        "published_at": "2026-01-28T21:36:10Z"
      },
      {
        "author": "@RedRose4141",
        "text": "Steven Miller needs dealt with Now",
        "likes": 13,
        "published_at": "2026-01-29T00:00:53Z"
      },
      {
        "author": "@skipit-l1e",
        "text": "Again USA breaks international law.Again they show how ill equipped the President is for the job. He is a predator of young girls and women, we want the Epstein Files released.",
        "likes": 77,
        "published_at": "2026-01-28T21:02:34Z"
      },
      {
        "author": "@fauxtaux",
        "text": "I am so ashamed of my country 🤦‍♀️",
        "likes": 10,
        "published_at": "2026-01-29T02:26:44Z"
      },
      {
        "author": "@Rayon-p7t",
        "text": "Entering a foreign embassy is contrary to international law!!",
        "likes": 3,
        "published_at": "2026-01-29T12:13:30Z"
      },
      {
        "author": "@strategicplays2977",
        "text": "No training in ice terrifying that we may have Farages ice soon scary 😧",
        "likes": 3,
        "published_at": "2026-01-29T01:21:21Z"
      },
      {
        "author": "@horaciokanashiro-hv2zn",
        "text": "🚔 🚨  Here they come! The brand new Keystone Cops 🚨 🚓",
        "likes": 8,
        "published_at": "2026-01-28T21:54:19Z"
      },
      {
        "author": "@MikeKim-s7y",
        "text": "Diplomatic Immunity states that the staffer can shoot him in the head point blank as he crosses over the threshold with total impunity.",
        "likes": 2,
        "published_at": "2026-01-29T14:37:17Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:37.338387"
  },
  {
    "video_id": "xibp_lWtJVU",
    "title": "How China is 'owning the future' of global power | BBC Global News Podcast | BBC News",
    "description": "Sir Keir Starmer travelled to Beijing to meet President Xi Jinping - the first time a British prime minister has visited the country since 2018. \n \nStarmer said he wants to achieve a \"comprehensive and consistent approach to China\". \n \nThe visit comes amid controversy over China's alleged human rights abuses and security concerns over a planned Chinese 'mega-embassy' in London.\n \nStarmer is the latest of a string of Western leaders to visit China - earlier this month, Canada's Prime Minister Mark Carney visited Beijing and reached a new trade agreement with China, saying his country was adjusting to a \"new reality\" of a \"new world order\", in the wake of US President Trump's agenda and tariffs. \n \nWhile Donald Trump's trade policies have strained ties with traditional US allies, China has been fostering relationships with other countries including the UK, Canada and India.\n \nWe speak to our China correspondent Laura Bicker from Beijing to discuss the perks and pitfalls of trading with China. \n \nSubscribe to the Global News Podcast wherever you get your podcasts or find more episodes here: https://bbc.in/GlobalNewsPodcast\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#China #GlobalPower #BBCNews",
    "published_at": "2026-01-28T20:00:52Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT11M34S",
    "views": 142681,
    "likes": 1637,
    "comments_count": 1761,
    "comments": [
      {
        "author": "@tennisguru6739",
        "text": "ICE randomly killing people on street, have you said a single word about human rights?????",
        "likes": 626,
        "published_at": "2026-01-28T22:37:57Z"
      },
      {
        "author": "@NFurst-n3w",
        "text": "Where&#39;s the BBC&#39;s usual rebuttal to China &quot;but at what cost?&quot;.",
        "likes": 147,
        "published_at": "2026-01-28T22:13:36Z"
      },
      {
        "author": "@dynasty781",
        "text": "Human rights 😂",
        "likes": 403,
        "published_at": "2026-01-28T20:07:14Z"
      },
      {
        "author": "@paulmatters2641",
        "text": "The forced opium on China. They invaded China. They forced treaties on China. They treated Chinese like dogs. Now lecture on human rights. Really?",
        "likes": 924,
        "published_at": "2026-01-28T21:09:20Z"
      },
      {
        "author": "@TonyYam-b2e",
        "text": "Your reporter is talk a load of rubbish.",
        "likes": 218,
        "published_at": "2026-01-28T20:28:12Z"
      },
      {
        "author": "@Vision-vp2fp",
        "text": "Human rights? <br>Well, just ask BBC News, the source of all narratives  of human rights abuses worldwide outside the UK.",
        "likes": 255,
        "published_at": "2026-01-28T21:23:09Z"
      },
      {
        "author": "@chenpaul99",
        "text": "Human rights Talk, zero self-awareness and shame?",
        "likes": 326,
        "published_at": "2026-01-28T22:10:25Z"
      },
      {
        "author": "@cnl6477",
        "text": "America &amp; Israel have more human rights issues. Please acknowledge that.",
        "likes": 158,
        "published_at": "2026-01-28T22:38:57Z"
      },
      {
        "author": "@Whyworrie",
        "text": "What&#39;s happened in Gaza？ human Rights? 😂😂😂😂Suddenly British start worrying about human rights, unbelievable",
        "likes": 414,
        "published_at": "2026-01-28T20:58:22Z"
      },
      {
        "author": "@donaldchurchill4092",
        "text": "UK/US are undisputed champions in Human Right Abuse and Spying, far ahead of the rest of the world combined.",
        "likes": 267,
        "published_at": "2026-01-28T22:03:07Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:37.747609"
  },
  {
    "video_id": "Ra6p7PkNWBM",
    "title": "Nicki Minaj says she's probably Donald Trump's 'number one fan'. #BBCNews",
    "description": "",
    "published_at": "2026-01-28T19:40:00Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT1M",
    "views": 48005,
    "likes": 550,
    "comments_count": 265,
    "comments": [
      {
        "author": "@vickihagberg3951",
        "text": "She’s trying to avoid deportation",
        "likes": 76,
        "published_at": "2026-01-28T22:33:15Z"
      },
      {
        "author": "@pernellhaynesworth1212",
        "text": "She scared to be deported😂😂😂🇹🇹",
        "likes": 188,
        "published_at": "2026-01-28T19:59:07Z"
      },
      {
        "author": "@juliecayer3737",
        "text": "Is it me or does she look petrified ?",
        "likes": 111,
        "published_at": "2026-01-28T19:53:12Z"
      },
      {
        "author": "@ComradeAlexander",
        "text": "This really looks like a hostage situation WTF",
        "likes": 12,
        "published_at": "2026-01-29T00:58:01Z"
      },
      {
        "author": "@G9Classified9",
        "text": "2 clowns smh 😂😂",
        "likes": 56,
        "published_at": "2026-01-28T20:07:53Z"
      },
      {
        "author": "@TheShortCon",
        "text": "She&#39;s going to feel that in her music sales",
        "likes": 87,
        "published_at": "2026-01-28T21:47:02Z"
      },
      {
        "author": "@TheDivineCalls333",
        "text": "Blink twice if you need help.",
        "likes": 103,
        "published_at": "2026-01-28T19:56:54Z"
      },
      {
        "author": "@ductgoosefpv",
        "text": "How high is she 😂👀👀",
        "likes": 71,
        "published_at": "2026-01-28T20:17:38Z"
      },
      {
        "author": "@p.e-h5606",
        "text": "Something is very wrong here😮😮😮😮",
        "likes": 62,
        "published_at": "2026-01-28T21:06:32Z"
      },
      {
        "author": "@markwilson441",
        "text": "Why is the way hes shuffling behind seem so unsettling? Also the way shes talking sounds almost like a hostage situation.",
        "likes": 27,
        "published_at": "2026-01-28T22:01:23Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:38.091379"
  },
  {
    "video_id": "RYPp71uA4iE",
    "title": "Badenoch says Tory defectors to Reform are 'drama queens' having a 'tantrum' | BBC Newscast",
    "description": "UK Conservative party leader Kemi Badenoch, gave a speech addressing Conservative defectors and detractors.\n\nAdam chats to Alex, in Westminster about how Badenoch’s speech accused her opponents of \"psychodrama’\", called defectors \"drama queens\" and presented her vision for the future of the Conservative party.\n\nAnd we catch up with Chris in Beijing about what he’s seen and heard so far on his trip with the prime minister.\n\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\n\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\n\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\n\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Reform #Badenoch #Starmer #BBCNews",
    "published_at": "2026-01-28T19:00:33Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "world",
      "starmer",
      "uk news",
      "reform",
      "kemi badenoch",
      "farage"
    ],
    "category_id": "25",
    "duration": "PT23M16S",
    "views": 12103,
    "likes": 88,
    "comments_count": 79,
    "comments": [
      {
        "author": "@dolgorwel",
        "text": "If the Tories and Reform split the far right vote then thats good for the party&#39;s offering positive constructive policies.  Let them squabble.",
        "likes": 2,
        "published_at": "2026-01-29T07:56:56Z"
      },
      {
        "author": "@Deadbeat-k1l",
        "text": "&#39;drama queens&#39; having a &#39;tantrum&#39; This is the level that our politics has fallen to, zero statesmanship!",
        "likes": 1,
        "published_at": "2026-01-29T11:45:53Z"
      },
      {
        "author": "@andybramwell9179",
        "text": "We&#39;ll have some policies that we want to vote for. Both parties are offering noting .",
        "likes": 4,
        "published_at": "2026-01-28T20:04:21Z"
      },
      {
        "author": "@Gary-le7dz",
        "text": "Latest you gov poll reform are just 4% in front of labour , still 3 half years from an election …. Also most people in thid cointry vote for centrist left leaning parties ….43% last election voted for right learning last election …. The right are a minority",
        "likes": 1,
        "published_at": "2026-01-29T07:56:05Z"
      },
      {
        "author": "@danb8",
        "text": "No one wants the tories now",
        "likes": 9,
        "published_at": "2026-01-28T19:19:54Z"
      },
      {
        "author": "@undervine",
        "text": "Uniparty system, reds, blues or conform all the same",
        "likes": 0,
        "published_at": "2026-01-29T08:03:37Z"
      },
      {
        "author": "@thomassayers8559",
        "text": "They look well finished. Leavers or Remainers don&#39;t support them. Kemi plays to the gallery. They have themselves extinct. Well have some idea in May.",
        "likes": 0,
        "published_at": "2026-01-29T16:59:52Z"
      },
      {
        "author": "@KidCharlemagne-n2r",
        "text": "No.",
        "likes": 0,
        "published_at": "2026-01-29T19:27:42Z"
      },
      {
        "author": "@geraldreid5285",
        "text": "Who kerman Badenoch think she is for one thing I didn&#39;t won&#39;t her the one I, wanted me go to Reform they can Belly ache all they want and it&#39;s all right pulling them apart and the Conservative had 14 years should of done things in stead of back stabbing each other so you don&#39;t deserve to run the country again",
        "likes": 0,
        "published_at": "2026-01-29T15:44:17Z"
      },
      {
        "author": "@JonathanBeadle-s8h",
        "text": "Farage is going to totally destroy the labour party at the next election. <br>For every day that passes, the more crushing Farage’s victory will be.<br>Red wall ??? What red wall ?????????? 😆",
        "likes": 2,
        "published_at": "2026-01-29T07:36:50Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:38.367018"
  },
  {
    "video_id": "Gpta84GpreQ",
    "title": "What did John Cena tell Drew McIntyre on his farewell tour? #WWE #JohnCena #BBCNews",
    "description": "",
    "published_at": "2026-01-28T18:40:00Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT46S",
    "views": 10204,
    "likes": 85,
    "comments_count": 3,
    "comments": [
      {
        "author": "@farida_naryn",
        "text": "Believe it or not, this man is BTS fan.",
        "likes": 4,
        "published_at": "2026-01-28T18:55:12Z"
      },
      {
        "author": "@KelvinChunguKaunda",
        "text": "Are they wearing matching makeup 😂",
        "likes": 0,
        "published_at": "2026-01-30T04:34:44Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:38.616865"
  },
  {
    "video_id": "ILbFvTU6sFA",
    "title": "Mum says university 'failed' son who took his own life after grade error | BBC Radio 4 World At One",
    "description": "The mother of a student who took his own life after wrongly being told he could not graduate says he was \"failed\" by Glasgow University after a report highlighted serious concerns.\n \nAn investigation by the Quality Assurance Agency for Higher Education found that the university's processes posed a \"systemic risk to academic standards\".\n \nIts review was carried out after the death of Ethan Brown, who should have been awarded a 2:1 degree but was incorrectly told he had not passed his course.\n \nHis mother, Tracy Scott, said her son was \"robbed\" of his degree, and changes must be made to \"safeguard\" current and future students.\n \nGlasgow University apologised and said it fully accepted the report's recommendations.\n \nIf you have been affected by this story, visit the BBC Action Line for support: https://www.bbc.co.uk/actionline/\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#GlasgowUniversity #Glasgow #BBCNews",
    "published_at": "2026-01-28T18:00:18Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT5M27S",
    "views": 14940,
    "likes": 139,
    "comments_count": 113,
    "comments": [
      {
        "author": "@SherkoSeaWiley",
        "text": "As a former International student at Glasgow,  it is always being like that. They even use visa renewal pressure on International student to accept a lower grade or no graduation or face visa withdrawal from university.  Disgusting practices by disgusting staff at higher levels.",
        "likes": 32,
        "published_at": "2026-01-28T18:46:50Z"
      },
      {
        "author": "@justaguythaine",
        "text": "So sorry that this lad placed so much of his own value and prospects into a piece of paper. So very sad, condolonces to the family.",
        "likes": 9,
        "published_at": "2026-01-28T23:45:03Z"
      },
      {
        "author": "@kyleefaren3075",
        "text": "I remember that feeling. Failing or passing felt like life or death. Even though I knew life was more than grades, the adrenaline and cortisol made it feel way more intense than it actually was.",
        "likes": 33,
        "published_at": "2026-01-28T18:19:08Z"
      },
      {
        "author": "@aNicerPlace",
        "text": "I&#39;ve had my fair share of dark times but getting the sh*test grade in my final year at uni wasn&#39;t one of them. Parents should feel more accountable FFS!",
        "likes": 5,
        "published_at": "2026-01-28T21:06:28Z"
      },
      {
        "author": "@SunnahLife-w5l",
        "text": "The government and everyone in general have forgotten about young men its just sad",
        "likes": 6,
        "published_at": "2026-01-28T20:42:08Z"
      },
      {
        "author": "@unvaccinatedAndPureBlood",
        "text": "Kids dont really know that life isnt a degree, but we all know it takes work to get a degree and this kid worked hard.",
        "likes": 13,
        "published_at": "2026-01-28T18:04:43Z"
      },
      {
        "author": "@marcdawson2156",
        "text": "It’s terrible sad that a young man has taken his life but this constant need to blame someone else is becoming tiresome, we are each responsible for our own lives and actions life will happen sometimes good sometimes bad it’s the job of a parent to prepare their children for reality.",
        "likes": 7,
        "published_at": "2026-01-28T20:28:00Z"
      },
      {
        "author": "@StayVCA98",
        "text": "This hits right home here actually, I remember when my University lets me enroll already passed subjects of mine again as in their system it’s still wrongly marked as fail TWICE in two sems, good thing I doubled checked it, but it makes me wonder what abt those times that I didn’t as I am blindly enrolling already passed subjects, its painful to think back as it wasted not only our money but also time and years, it hurts…",
        "likes": 9,
        "published_at": "2026-01-28T18:17:06Z"
      },
      {
        "author": "@Hellsing7747",
        "text": "It&#39;s sad. But for sure the kid had problems.  It sucks",
        "likes": 43,
        "published_at": "2026-01-28T18:12:02Z"
      },
      {
        "author": "@Happy_Buddah_Bonsai_UK",
        "text": "Very sad 😔 RIP",
        "likes": 2,
        "published_at": "2026-01-28T22:37:44Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:38.912237"
  },
  {
    "video_id": "tdPl8zr1RQk",
    "title": "Drew McIntyre says he's 'torn' over John Cena's final match #WWE #JohnCena #BBCNews",
    "description": "",
    "published_at": "2026-01-28T17:40:00Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT48S",
    "views": 7438,
    "likes": 101,
    "comments_count": 11,
    "comments": [
      {
        "author": "@sjdbdkoswq",
        "text": "Nobody cares about zong xina",
        "likes": 5,
        "published_at": "2026-01-28T17:48:05Z"
      },
      {
        "author": "@kenpochrstn",
        "text": "Come on yes they are athletic. Yes, I know they do some things that can get them hurt. But in the end, the matches are scripted so there’s no real challenge. There’s no real match. I just don’t understand how people watch this stuff. And then celebrate so-and-so one woo hoo. When in reality, all they did was stick to the script.",
        "likes": 2,
        "published_at": "2026-01-28T19:08:59Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:39.162493"
  },
  {
    "video_id": "DgvBjtjG_0M",
    "title": "Donald Trump warns Iran 'time is running out' for nuclear deal | BBC News",
    "description": "Donald Trump has warned Iran that \"time is running out\" to negotiate a deal on its nuclear programme following the steady build-up of US military forces in the Gulf.\n \nThe US president said a \"massive Armada\" was \"moving quickly, with great power, enthusiasm, and purpose\" towards Iran, referring to a large US naval force.\n \nIn response, Iran's mission to the UN said Tehran \"stands ready for dialogue based on mutual respect and interests\", but if pushed, it wrote in all capitals, it would defend itself and \"respond like never before\".\n \nIran insists its nuclear programme is entirely peaceful and has repeatedly denied seeking to develop nuclear weapons.\n \nTrump's latest warning to Iran's leaders follows his promise that Washington would intervene to help those involved in the brutal and unprecedented crackdown on demonstrations in the country earlier this month.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Iran #DonaldTrump #BBCNews",
    "published_at": "2026-01-28T17:00:33Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT7M45S",
    "views": 188126,
    "likes": 1428,
    "comments_count": 1327,
    "comments": [
      {
        "author": "@enlightnedsoul4124",
        "text": "&quot;I will end every conflict within 24 hours &quot;",
        "likes": 31,
        "published_at": "2026-01-28T18:09:25Z"
      },
      {
        "author": "@Mw2u-b9m",
        "text": "I thought trump said he already took out there nuclear capability months ago",
        "likes": 307,
        "published_at": "2026-01-28T17:02:11Z"
      },
      {
        "author": "@jrgonzales2024",
        "text": "The Chairman of the Board of Peace is going to start a war.",
        "likes": 253,
        "published_at": "2026-01-28T17:07:52Z"
      },
      {
        "author": "@ste4646-u8m",
        "text": "look over there not the epstien files",
        "likes": 131,
        "published_at": "2026-01-28T17:23:55Z"
      },
      {
        "author": "@estonkalutwa-yc8ps",
        "text": "Wait, I thought this was about protestors 😂😂😂",
        "likes": 128,
        "published_at": "2026-01-28T17:45:49Z"
      },
      {
        "author": "@ShiftyGeeza",
        "text": "Hold on.  I thought this was about the Iranian protestors this time.  Now it&#39;s about the nuclear program that he said had been obliterated the last time??<br><br>And to add to the absurdity, there used to be a nuclear deal.  The JCPOA, which was overseen by the IAEA and guarantored by European countries with regular inspections, and permanently positioned live camera feeds in all Iranian facilities that Trump ripped up himself.<br><br>Just put him in a straightjacket and lock him up in a padded cell already.  The biggest, most beautiful padded cell you&#39;ve ever seen.  The orderlys of the institution will have to have tears in their eyes while addressing him as &quot;sir&quot; though.",
        "likes": 67,
        "published_at": "2026-01-28T17:43:37Z"
      },
      {
        "author": "@GagzoD82",
        "text": "Another day, another threat to deflect from Epstein files",
        "likes": 16,
        "published_at": "2026-01-28T17:45:35Z"
      },
      {
        "author": "@abc98127",
        "text": "There should be Regime change in USA",
        "likes": 140,
        "published_at": "2026-01-28T18:13:29Z"
      },
      {
        "author": "@russshaber8071",
        "text": "Trump plans &quot;Endless Wars&quot; in hopes that will keep the Epstein files hidden until he dies.",
        "likes": 146,
        "published_at": "2026-01-28T17:25:20Z"
      },
      {
        "author": "@GamerFrisco",
        "text": "Time is running out to release the Epstein files",
        "likes": 169,
        "published_at": "2026-01-28T17:08:25Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:39.506979"
  },
  {
    "video_id": "D8bBHbeygw0",
    "title": "Drew McIntyre says UK Wrestlemania 'better be in next 10 years' #WWE #Wrestlemania #BBCNews",
    "description": "",
    "published_at": "2026-01-28T16:40:00Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT35S",
    "views": 7879,
    "likes": 76,
    "comments_count": 6,
    "comments": [
      {
        "author": "@2179summerbreeze",
        "text": "My grandbabies love WWE ! I plan our vacation around WWE ! We have seen them in DC , NY, MA and I am trying to get tickets to VA",
        "likes": 3,
        "published_at": "2026-01-28T17:06:54Z"
      },
      {
        "author": "@yarc9-p1x",
        "text": "you  will need that  international money",
        "likes": 1,
        "published_at": "2026-01-28T19:29:00Z"
      },
      {
        "author": "@jamesbishop9156",
        "text": "Violence has been made attractive, unfortunately...😢❤",
        "likes": 1,
        "published_at": "2026-01-28T16:51:34Z"
      },
      {
        "author": "@shaw9908",
        "text": "I like to force World Wrestling Entertainment into Australia considering The United States Of America have loads of sports that could really get more expensive <a href=\"http://www.youtube.com/results?search_query=%23thenba\">#TheNBA</a> <a href=\"http://www.youtube.com/results?search_query=%23thenfl\">#TheNFL</a> <a href=\"http://www.youtube.com/results?search_query=%23themlb\">#TheMLB</a>",
        "likes": 1,
        "published_at": "2026-01-28T17:24:39Z"
      },
      {
        "author": "@shaw9908",
        "text": "<a href=\"http://www.youtube.com/results?search_query=%23england\">#England</a> it&#39;s more home to <a href=\"http://www.youtube.com/results?search_query=%23europeanfootballandthenhl\">#EuropeanFootballAndTheNHL</a> once &quot;Great&quot; Britain ends when really like The Land Of Great Australia sounds better anything though not in <a href=\"http://www.youtube.com/results?search_query=%23europe\">#Europe</a> <a href=\"http://www.youtube.com/results?search_query=%23theaustralianspleasecreatesomethingbrandnew\">#TheAustraliansPleaseCreateSomethingBrandNew</a>",
        "likes": 1,
        "published_at": "2026-01-28T17:35:48Z"
      },
      {
        "author": "@LiquorSnurf-Cymru",
        "text": "Uk doesnt want Wrestlemania.",
        "likes": 1,
        "published_at": "2026-01-29T00:01:30Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:39.757361"
  },
  {
    "video_id": "v4Hui5bZwzo",
    "title": "'I couldn't save my three sons when they fell in a frozen lake.' #US #BBCNews",
    "description": "",
    "published_at": "2026-01-28T14:40:01Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT39S",
    "views": 19683,
    "likes": 213,
    "comments_count": 57,
    "comments": [
      {
        "author": "@monicabrennan7111",
        "text": "May God heal your heart. Praying for you and your family.",
        "likes": 14,
        "published_at": "2026-01-28T16:22:24Z"
      },
      {
        "author": "@bobbyk1023",
        "text": "I lost two of my babies, and I’m sorry for your loss, and I hope you can find strength through this horrible tragedy. It’s the hardest thing you’ll ever know, may God and His angels be with you.",
        "likes": 13,
        "published_at": "2026-01-28T16:38:39Z"
      },
      {
        "author": "@MicheleAudreyBall",
        "text": "My heart goes out to this lady.  There isn&#39;t much worse that could happen to a parent.  God bless her and her family. It happens more than people know.",
        "likes": 11,
        "published_at": "2026-01-29T00:36:39Z"
      },
      {
        "author": "@angelgirldebbiejo",
        "text": "Why were they even near this pond?",
        "likes": 11,
        "published_at": "2026-01-28T18:10:09Z"
      },
      {
        "author": "@denisemurphy3915",
        "text": "Something very dubious about this account. Caring parents would jump in absolutely, and never let them near a pond, especially in winter.",
        "likes": 3,
        "published_at": "2026-01-29T05:38:26Z"
      },
      {
        "author": "@truskool1971",
        "text": "Three Kids playing on sheet ice ? <br>Unattended ? Huh ?",
        "likes": 1,
        "published_at": "2026-01-29T00:17:28Z"
      },
      {
        "author": "@TRGanamurthy-v2m",
        "text": "❤🙏",
        "likes": 0,
        "published_at": "2026-01-29T03:27:33Z"
      },
      {
        "author": "@creater-h8s",
        "text": "So sorry for your loss❤🙏😢 May God heal your heart. You are not to blame.",
        "likes": 5,
        "published_at": "2026-01-28T16:03:12Z"
      },
      {
        "author": "@KelvinChunguKaunda",
        "text": "Why why why😂",
        "likes": 1,
        "published_at": "2026-01-29T05:07:18Z"
      },
      {
        "author": "@Ricky-qq2bz",
        "text": "Shouldn&#39;t have been on the ice in 1st place smh. Rip boys so sad",
        "likes": 14,
        "published_at": "2026-01-28T15:05:19Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:40.104247"
  },
  {
    "video_id": "vZWNm8CQkNY",
    "title": "I will speak out on misogyny, says first woman to lead Church of England | BBC News",
    "description": "Dame Sarah Mullally has been officially confirmed as the 106th Archbishop of Canterbury in a ceremony rich with centuries-old tradition at St Paul's Cathedral in London.\n \nHer predecessor, Justin Welby, resigned following accusations he did not do enough with information he had about a prolific abuser to prevent further abuse from taking place.\n \nDame Sarah is the first woman to lead the Church of England and told the BBC she is committed to speaking out about misogyny where she sees it and it was right that there was greater scrutiny on her own record in dealing with safeguarding in the Church.\n \nThe ceremony to confirm Dame Sarah was a mix of religious service and legal process - for part of the ceremony, the cathedral became a courthouse where legal rites, written down in 1533 but with their origins much earlier, were enacted.\n \nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#ChurchofEngland #ArchbishopofCantebury #BBCNews",
    "published_at": "2026-01-28T14:15:14Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT7M48S",
    "views": 28889,
    "likes": 272,
    "comments_count": 1127,
    "comments": [
      {
        "author": "@rogercude1459",
        "text": "Church and politicians both talk nothing but lies..",
        "likes": 157,
        "published_at": "2026-01-28T15:10:26Z"
      },
      {
        "author": "@aindriubradleymarshall6226",
        "text": "Politicians, royalty and clergy  corrupt to the core.",
        "likes": 282,
        "published_at": "2026-01-28T14:59:43Z"
      },
      {
        "author": "@chimpanzoib",
        "text": "Henry the 8th turning in his grave😂",
        "likes": 107,
        "published_at": "2026-01-28T15:10:55Z"
      },
      {
        "author": "@DasTubemeister",
        "text": "Im looking forward to her speech on grooming gangs, honour killings and forced marriage.",
        "likes": 134,
        "published_at": "2026-01-28T15:55:41Z"
      },
      {
        "author": "@louisvladimir29",
        "text": "Very progressive. Im sure it will be reflected in church attendance...",
        "likes": 68,
        "published_at": "2026-01-28T15:24:22Z"
      },
      {
        "author": "@brucewilkinson3942",
        "text": "If you all thought Welby was bad, just wait and watch.",
        "likes": 59,
        "published_at": "2026-01-28T16:12:02Z"
      },
      {
        "author": "@AmericanRooted",
        "text": "This is what infiltrating religion looks like. She will never be taken seriously, and that&#39;s their goal.",
        "likes": 184,
        "published_at": "2026-01-28T15:13:02Z"
      },
      {
        "author": "@strangelee4400",
        "text": "Another globalist washing the feet of her masters at Davos.",
        "likes": 52,
        "published_at": "2026-01-28T15:47:48Z"
      },
      {
        "author": "@flabbybum9562",
        "text": "I think it&#39;s wrong of her to describe everyone with concerns as misogynistic. It makes her sound more like the head of a political organisation than a Christian Church.",
        "likes": 134,
        "published_at": "2026-01-28T15:20:57Z"
      },
      {
        "author": "@alanmckay7040",
        "text": "It&#39;s almost as if they are trying to destroy the church on purpose.",
        "likes": 213,
        "published_at": "2026-01-28T15:07:20Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:40.525619"
  },
  {
    "video_id": "EpISdYV1_Go",
    "title": "Chris Brown arrives at court for assault case hearing. #ChrisBrown #BBCNews",
    "description": "",
    "published_at": "2026-01-28T13:40:00Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT15S",
    "views": 27332,
    "likes": 0,
    "comments_count": 0,
    "comments": [],
    "fetched_at": "2026-01-30T14:46:40.738522"
  },
  {
    "video_id": "C4uELLwkXGs",
    "title": "Funeral held in Israel for last hostage retrieved from Gaza | BBC News",
    "description": "Israel is expected to reopen the Gaza Strip's key border crossing with Egypt, now that the funeral for the last hostage retrieved from Gaza has been able to take place.\n \nThe Rafah crossing has been mostly closed since May 2024, when the Palestinian side was seized by Israeli force.\n \nIt was meant to have reopened during the first stage of the ceasefire between Israel and Hamas, which began in October however, the Israeli government made that conditional on Hamas making every effort to return the body of the last hostage, police officer Master Sgt Ran Gvili.\n \nThe Israeli military said it has retrieved the body of the last hostage in Gaza, paving the way for the next phase of US President Donald Trump's peace plan to get under way.\n \nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Israel #Gaza #BBCNews",
    "published_at": "2026-01-28T13:17:24Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT3M2S",
    "views": 9993,
    "likes": 78,
    "comments_count": 158,
    "comments": [
      {
        "author": "@LeonardCooper-z3c",
        "text": "When will Israel release its hostages?",
        "likes": 35,
        "published_at": "2026-01-28T14:38:49Z"
      },
      {
        "author": "@MrStevieb00",
        "text": "IV got a yoghurt that goes out of date tonight",
        "likes": 7,
        "published_at": "2026-01-29T22:42:48Z"
      },
      {
        "author": "@Donny_Trumpstein",
        "text": "BBC back pushing their Zion Agenda again 🤮",
        "likes": 28,
        "published_at": "2026-01-28T14:50:06Z"
      },
      {
        "author": "@clairelongshaw4068",
        "text": "Two years since 6 year old  Hind Rajab was killed alongside her family after their car was shot up 335 times by the illegal occupiers.",
        "likes": 12,
        "published_at": "2026-01-29T21:10:17Z"
      },
      {
        "author": "@abcd-qe9js",
        "text": "Hypocrisy and duppelstandards all the way!!",
        "likes": 7,
        "published_at": "2026-01-29T21:49:46Z"
      },
      {
        "author": "@robinherbert2537",
        "text": "Hey BBC... Can you show the funeral for the 35,000 child killed by the IGF in this state sponsored genocide??? Just a thought, to show impartial reporting.",
        "likes": 8,
        "published_at": "2026-01-29T21:12:26Z"
      },
      {
        "author": "@letmeinwillu",
        "text": "If Israel held funerals for the Palestinian women and children they murdered, they would be full on for decades",
        "likes": 9,
        "published_at": "2026-01-29T21:12:25Z"
      },
      {
        "author": "@Lynl1p",
        "text": "It is amazing how this is so important for the BBC to cover this one person when Israel is bombing and killing Palestinians every day, several times a day. Is the BBC funded by Zionists or Brits.?",
        "likes": 19,
        "published_at": "2026-01-28T21:30:14Z"
      },
      {
        "author": "@oconatar",
        "text": "Wbt the 30000 dead gazens?",
        "likes": 21,
        "published_at": "2026-01-29T20:46:56Z"
      },
      {
        "author": "@muhammadkamal9962",
        "text": "What about FUNERAL OF 72000 INNOCENT PALESTINIANS WOMEN AND CHILDREN?",
        "likes": 10,
        "published_at": "2026-01-29T21:32:41Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:41.100189"
  },
  {
    "video_id": "Yk6C7UVRUgw",
    "title": "UK PM given flowers on arrival in China. #China #UK #BBCNews",
    "description": "",
    "published_at": "2026-01-28T12:40:01Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT24S",
    "views": 44854,
    "likes": 633,
    "comments_count": 285,
    "comments": [
      {
        "author": "@rehanansari009",
        "text": "China traders vs America invaders",
        "likes": 60,
        "published_at": "2026-01-28T12:48:58Z"
      },
      {
        "author": "@marialena2399",
        "text": "I read somewhere that Starmer is planning to visit the UK soon.",
        "likes": 58,
        "published_at": "2026-01-28T13:46:04Z"
      },
      {
        "author": "@Lighthawk1986",
        "text": "Gets a warmer welcome there than here lol.",
        "likes": 61,
        "published_at": "2026-01-28T13:02:28Z"
      },
      {
        "author": "@AdrianCollins-t1y",
        "text": "It makes a change from free glasses clothes and accommodation.",
        "likes": 4,
        "published_at": "2026-01-28T14:50:16Z"
      },
      {
        "author": "@ReallyfastwindsUnbelievable",
        "text": "Better than the tories and doing well recently.",
        "likes": 5,
        "published_at": "2026-01-28T17:01:41Z"
      },
      {
        "author": "@EverythingisaRemix164",
        "text": "The one time I wish this was Ai...",
        "likes": 12,
        "published_at": "2026-01-28T12:55:19Z"
      },
      {
        "author": "@DwayneDibley-rd",
        "text": "Bro deserves his flowers❤",
        "likes": 4,
        "published_at": "2026-01-28T14:16:58Z"
      },
      {
        "author": "@RolandMat-u6y",
        "text": "Usually when we ask somebody’s name then we have to say that name after them but the PM thought hummm I am not going to say your name 😄😄",
        "likes": 3,
        "published_at": "2026-01-29T09:02:03Z"
      },
      {
        "author": "@bowlcutballfro",
        "text": "The only reason they giving him flowers is because he is not their PM",
        "likes": 4,
        "published_at": "2026-01-28T13:07:32Z"
      },
      {
        "author": "@barbaraadams7338",
        "text": "Our PM in his spiritual home. Hear him speaking in a normal voice.  Not Dalek like we in UK  get. Lovely. It warms me to know our PM is actually human   <br>Such a shame he treats the people paying his wages with such contempt!<br>How much did this cost the UK taxpayers?????",
        "likes": 1,
        "published_at": "2026-01-28T13:51:14Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:41.351657"
  },
  {
    "video_id": "eU5XniYGbIY",
    "title": "Donald Trump says government will 'de-escalate' in Minnesota after Pretti shooting | BBC News",
    "description": "President Donald Trump said his administration was \"going to de-escalate a little bit\" in Minnesota, after the second fatal shooting of a US citizen by federal immigration officers there.\n \n\"Bottom line, it was terrible. Both of them were terrible,\" he said in a Fox News interview on Tuesday.\n \nIn early January Renee Good was fatally shot by an immigration officer, followed by Alex Pretti, who was killed after being stopped by border agents this past weekend.\n \nPretti's death reignited local protests and public outcry across the country, and led to criticism from lawmakers in both parties.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n\n#Minnesota #DonaldTrump #BBCNews",
    "published_at": "2026-01-28T12:15:06Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT5M8S",
    "views": 17249,
    "likes": 149,
    "comments_count": 148,
    "comments": [
      {
        "author": "@jenmu7870",
        "text": "The self-titled &#39;Nobel Peace Prize laureate&quot;... 😂🤦‍♂️",
        "likes": 100,
        "published_at": "2026-01-28T12:29:34Z"
      },
      {
        "author": "@AnticsofaMamaSquirrel",
        "text": "Where’s the Epstein files though?",
        "likes": 51,
        "published_at": "2026-01-28T12:16:46Z"
      },
      {
        "author": "@hourbee5535",
        "text": "Where is the body cam footage?",
        "likes": 26,
        "published_at": "2026-01-28T12:22:31Z"
      },
      {
        "author": "@Adrian-GBM",
        "text": "Some of the ICE agents have knuckle dusters hanging from their ridiculous kit. Can anyone think of any possible justification for that? Pure thuggery?",
        "likes": 12,
        "published_at": "2026-01-28T12:40:39Z"
      },
      {
        "author": "@StephenRydel-wp8ss",
        "text": "Republicans need to stop kissing Trumps ass and impeach and jail all this Trump clown show",
        "likes": 20,
        "published_at": "2026-01-28T12:27:51Z"
      },
      {
        "author": "@D11Dozer",
        "text": "How about prison for all of them now?!?!",
        "likes": 10,
        "published_at": "2026-01-28T13:03:53Z"
      },
      {
        "author": "@BetchFace-v4f",
        "text": "They destroyed the evidence of his murder and slandered a law biding citizen.",
        "likes": 5,
        "published_at": "2026-01-28T12:44:43Z"
      },
      {
        "author": "@yannnoushka",
        "text": "New border czar Tom Homan accepted a $50,000 bag of cash from an undercover FBI agent last year in a since-closed U.S. Justice Department bribery investigation. 😳<br>In the alleged scheme, Homan promised immigration-related government contracts when he joined the Trump administration in exchange for the money. <br>Anyway, like any good kleptocracy, FBI Director Kash Patel ordered the investigation closed over the summer! 🤔<br>It’s totally unbelievable 🤯",
        "likes": 4,
        "published_at": "2026-01-28T12:50:37Z"
      },
      {
        "author": "@denismeans2910",
        "text": "Ho&#39;-Man is even worse than Bovino. This is just Trump&#39;s delaying tactic until his people can bring in enough force to overwhelm and subdue the protests. That will take time, maybe several weeks to calm things down before the second wave of ICE and military forces arrive. Trump won&#39;t back down but will double down at any cost.",
        "likes": 3,
        "published_at": "2026-01-28T12:55:03Z"
      },
      {
        "author": "@crocglox7797",
        "text": "that golden escalator guy can never be trusted to de-escalate anything",
        "likes": 2,
        "published_at": "2026-01-28T14:02:55Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:41.615721"
  },
  {
    "video_id": "qt-lkFCCEkY",
    "title": "Who is Greg Bovino and why is he leaving Minneapolis? #Minneapolis #BBCNews",
    "description": "",
    "published_at": "2026-01-28T11:40:01Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT1M2S",
    "views": 15529,
    "likes": 424,
    "comments_count": 50,
    "comments": [
      {
        "author": "@jeveritt8398",
        "text": "He needs to be in prison",
        "likes": 24,
        "published_at": "2026-01-28T12:01:47Z"
      },
      {
        "author": "@Moe-v8b",
        "text": "Horrible man and love&#39;s to show that, way to many narcissistic in position&#39;s of power",
        "likes": 24,
        "published_at": "2026-01-28T11:47:49Z"
      },
      {
        "author": "@EduardoSantos-om5ws",
        "text": "Fascista.",
        "likes": 27,
        "published_at": "2026-01-28T11:41:11Z"
      },
      {
        "author": "@davecooper3238",
        "text": "Is it true that Prettie’s gun has disappeared. Perhaps taken as a trophy.",
        "likes": 13,
        "published_at": "2026-01-28T11:44:24Z"
      },
      {
        "author": "@annab9994",
        "text": "So “great American” is a blunt liar and a dangerous criminal 😏",
        "likes": 6,
        "published_at": "2026-01-28T12:10:47Z"
      },
      {
        "author": "@MH-pz8wf",
        "text": "He should be investigated and charged and sent to jail",
        "likes": 2,
        "published_at": "2026-01-28T18:41:23Z"
      },
      {
        "author": "@waitz001",
        "text": "he needs to keep on leaving....leave Minnesota, leave America! Guantanomo is a good place for Bovine.",
        "likes": 18,
        "published_at": "2026-01-28T11:46:24Z"
      },
      {
        "author": "@geoffbell7513",
        "text": "What’s going on in the BBC microphone department?",
        "likes": 1,
        "published_at": "2026-01-29T15:26:07Z"
      },
      {
        "author": "@ericogle2845",
        "text": "Define ice and the border patrol make tougher laws on them, what they&#39;re doing is disgusting.",
        "likes": 2,
        "published_at": "2026-01-28T21:49:43Z"
      },
      {
        "author": "@ryzoid909",
        "text": "Funny how the the united states of America is the most fucked up country with the most tyrranical government in the whole of the west after russia.",
        "likes": 3,
        "published_at": "2026-01-28T12:12:42Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:42.392311"
  },
  {
    "video_id": "8vrWjaFSf8U",
    "title": "Keir Starmer first UK prime minister to visit China since 2018 | BBC News",
    "description": "Keir Starmer has arrived in China for a three-day visit - the first time a UK prime minister has visited the country since 2018.\n\nStarmer, who is travelling with around 60 British business and cultural leaders, will meet President Xi Jinping and develop trade ties.\n\nSpeaking on the flight to Beijing, Starmer said the trip will being benefits for people \"back at home\" and that he wants \"a comprehensive and consistent approach to China.”\n\nHowever, members of the UK team are all using \"disposable burner phone numbers and temporary email addresses” due to spying fears.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#KeirStarmer #China #BBCNews",
    "published_at": "2026-01-28T11:01:42Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT5M11S",
    "views": 178047,
    "likes": 1143,
    "comments_count": 1596,
    "comments": [
      {
        "author": "@perersoony5344",
        "text": "The staff at the Ministry of Foreign Affairs in Beijing are fed up. In January, they were constantly changing the national flags displayed along the roads: South Korea, France, Canada, Finland, and now the United Kingdom...",
        "likes": 185,
        "published_at": "2026-01-28T13:35:20Z"
      },
      {
        "author": "@cohcoh668",
        "text": "Denial, Anger, Bargaining, Depression, and Acceptance😂😂😂😂",
        "likes": 33,
        "published_at": "2026-01-28T23:32:58Z"
      },
      {
        "author": "@cohcoh668",
        "text": "Lets be clear. UK needs China. Not the other way around.😂",
        "likes": 86,
        "published_at": "2026-01-28T23:29:11Z"
      },
      {
        "author": "@leahcasey2678",
        "text": "This BBC report couldn&#39;t be more negative ... and what&#39;s the point of repeatedly showing the guy swimming?\r<br>Maybe this report could have shown the clean modern subways, hotel and restaurant robots, the abundant use of EV&#39;s, modern high-speed trains, renewable energy systems, safe streets and blazing fast 5G networks which are ubiquitous throughout China.<br>Is China trying to annex Greenland and Canada? Did China invade Venezuela? Did China bomb Iran or supply weapons to a country conducting a genocide? Is China stealing the mineral rights in Ukraine? Did China slap an arbitrary 25% tariff on UK exports?",
        "likes": 112,
        "published_at": "2026-01-28T12:12:03Z"
      },
      {
        "author": "@Just-An-AverageBear",
        "text": "New world order indeed",
        "likes": 319,
        "published_at": "2026-01-28T11:09:00Z"
      },
      {
        "author": "@HarryBungle",
        "text": "Over the last 30 year China has lifted out of poverty a billion people...The Western elites have done their best to do the exact opposite...funneling up all the money to just a small percentage of  society...and the BBC who force the British public to pay them , pay salaries that are 10 times the national average National salary to give us this biased bull",
        "likes": 189,
        "published_at": "2026-01-28T13:04:02Z"
      },
      {
        "author": "@Maldonado93",
        "text": "Wasn&#39;t China collapsing?  😂😂😂😂😂",
        "likes": 105,
        "published_at": "2026-01-28T23:36:51Z"
      },
      {
        "author": "@garethl738",
        "text": "The real question is: Can China trust the UK?",
        "likes": 60,
        "published_at": "2026-01-28T15:34:47Z"
      },
      {
        "author": "@HarryBungle",
        "text": "What does China want to spy on the UK for????....all the cutting edge technology...??...I think its whats called delusions of grandeur!😅",
        "likes": 149,
        "published_at": "2026-01-28T12:54:09Z"
      },
      {
        "author": "@eyesopen7946",
        "text": "May be Starmer will realise how broken dirty and backwards Britain  is by comparison to China , As i say may be",
        "likes": 80,
        "published_at": "2026-01-28T14:34:55Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:42.748305"
  },
  {
    "video_id": "4NERKiUDYwY",
    "title": "What is going on with US TikTok? #US #TikTok #BBCNews",
    "description": "",
    "published_at": "2026-01-28T10:42:24Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT1M25S",
    "views": 6611,
    "likes": 111,
    "comments_count": 11,
    "comments": [
      {
        "author": "@Complicitur",
        "text": "TikTok censored everything now 😂😂😂",
        "likes": 11,
        "published_at": "2026-01-28T11:09:40Z"
      },
      {
        "author": "@jeremymiller7385",
        "text": "Yes they are...",
        "likes": 7,
        "published_at": "2026-01-28T11:10:13Z"
      },
      {
        "author": "@denniswalton4178",
        "text": "Boycott",
        "likes": 6,
        "published_at": "2026-01-28T11:29:26Z"
      },
      {
        "author": "@Mixedbeats18",
        "text": "US seems like more a hard to say anything country that China by the day",
        "likes": 2,
        "published_at": "2026-01-28T10:59:13Z"
      },
      {
        "author": "@JackNardo-v7k",
        "text": "Time to uninstall.",
        "likes": 1,
        "published_at": "2026-01-28T14:26:37Z"
      },
      {
        "author": "@S.H.A.D.O.Banner",
        "text": "Is the US part of The UK?",
        "likes": 0,
        "published_at": "2026-01-28T21:29:34Z"
      },
      {
        "author": "@aztecdogNYC",
        "text": "Who gets the estimated $30 billion ticktock revenue now that the &quot;U.S.&quot; owns it?  Is the money going into some foreign bank account under Trumps name (or some corporate name)?   $30 billion would buy a lot of health coverage for American citizens. Only the poor are controlled by U.S. laws.",
        "likes": 1,
        "published_at": "2026-01-28T14:53:06Z"
      },
      {
        "author": "@tonysinclair4206",
        "text": "BBC is also controlled, the only propaganda world wide that ppl have to pay for…. DEFUND THE BBC",
        "likes": 0,
        "published_at": "2026-01-29T01:37:05Z"
      },
      {
        "author": "@davidpaul6615",
        "text": "100% <br>X is complete joke",
        "likes": 0,
        "published_at": "2026-01-28T19:40:28Z"
      },
      {
        "author": "@nocomparisonharrison",
        "text": "TikTok needs to sensor these political attacks and agendas. The American people are tired of that stuff. They are just trying to sway people&#39;s thinking and that&#39;s enough, we are glad the U.S. has control. Do you think China would allow an American social media site to take over China and get all their information? NO so neither will we. The infiltration is going to stop! Thank you president Trump for doing a good job!",
        "likes": 0,
        "published_at": "2026-01-28T15:59:10Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:43.013332"
  },
  {
    "video_id": "X7QfjBuWDiQ",
    "title": "US Congresswoman Ilhan Omar attacked with unknown liquid during town hall in Minnesota. #BBCNews",
    "description": "",
    "published_at": "2026-01-28T08:46:02Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT48S",
    "views": 56948,
    "likes": 393,
    "comments_count": 419,
    "comments": [
      {
        "author": "@user-cu5gc4qz8p",
        "text": "Really wish social media platforms like youtube would bother to take some action over bot farms, it is ridiculous.",
        "likes": 43,
        "published_at": "2026-01-28T11:46:21Z"
      },
      {
        "author": "@RebelPhoton",
        "text": "What a disgrace",
        "likes": 7,
        "published_at": "2026-01-28T10:13:58Z"
      },
      {
        "author": "@jeannehall6546",
        "text": "It was cider vinegar!",
        "likes": 1,
        "published_at": "2026-01-29T15:09:12Z"
      },
      {
        "author": "@jimbeans2466",
        "text": "I wonder what that attackers bank account will look like when he gets out of jail.",
        "likes": 1,
        "published_at": "2026-01-29T12:47:27Z"
      },
      {
        "author": "@erin.st.v",
        "text": "Comments should get locked out on this vid...<br>The comments are near entirely bots",
        "likes": 9,
        "published_at": "2026-01-28T12:35:38Z"
      },
      {
        "author": "@jimbeans2466",
        "text": "Did he shout &quot;THIS MAGA COUNTRY&quot;?",
        "likes": 1,
        "published_at": "2026-01-29T12:48:31Z"
      },
      {
        "author": "@boopboopbeep-f5i",
        "text": "The amount of russian troll farm bots in this comment section is staggering.",
        "likes": 42,
        "published_at": "2026-01-28T09:51:36Z"
      },
      {
        "author": "@alanperkins7314",
        "text": "THE “ATTACK” is BULLSHIT.",
        "likes": 37,
        "published_at": "2026-01-28T10:07:02Z"
      },
      {
        "author": "@Koichi-y3r",
        "text": "What the BBC are Not telling you. Is that llham Omar has been caught in a massive money laundering operation involving a Winery in California! Some 80 million dollars so far going through one of many fake businesses listed as her&#39;s the department of justice and the IRS investigations are ongoing",
        "likes": 67,
        "published_at": "2026-01-28T08:57:35Z"
      },
      {
        "author": "@debras.9519",
        "text": "The clown show is in town 🙄",
        "likes": 1,
        "published_at": "2026-01-29T02:10:08Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:43.264705"
  },
  {
    "video_id": "qtk7L1cFJBg",
    "title": "BBC visits West Bank town blockaded by IDF. #BBCNews",
    "description": "",
    "published_at": "2026-01-27T23:15:04Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT1M28S",
    "views": 10057,
    "likes": 165,
    "comments_count": 31,
    "comments": [
      {
        "author": "@aftonair",
        "text": "Ban AIPAC",
        "likes": 15,
        "published_at": "2026-01-27T23:33:07Z"
      },
      {
        "author": "@aftonair",
        "text": "End settler colonialism!",
        "likes": 16,
        "published_at": "2026-01-27T23:32:56Z"
      },
      {
        "author": "@roselipton2113",
        "text": "Rachel Corrie ❤❤❤",
        "likes": 6,
        "published_at": "2026-01-28T02:50:58Z"
      },
      {
        "author": "@1daycloser2home93",
        "text": "all the worlds a stage......",
        "likes": 2,
        "published_at": "2026-01-28T00:29:57Z"
      },
      {
        "author": "@S.H.A.D.O.Banner",
        "text": "That does not look like part of Britain to me",
        "likes": 0,
        "published_at": "2026-01-28T21:28:48Z"
      },
      {
        "author": "@KarlWomack",
        "text": "So they said that they wouldn&#39;t do this when it was supposed to be holocaust day.",
        "likes": 1,
        "published_at": "2026-01-28T01:37:06Z"
      },
      {
        "author": "@selvynchristophers1644",
        "text": "It’s no go area you should know that when the bulldozers ploughing the land around dismantling the buildings!",
        "likes": 0,
        "published_at": "2026-01-28T16:00:38Z"
      },
      {
        "author": "@h.chawiibt7882",
        "text": "I need blocked this bank!!",
        "likes": 0,
        "published_at": "2026-01-28T14:52:34Z"
      },
      {
        "author": "@spikeboy2954",
        "text": "What a surprise, a BBC reporter with a clear anti-israel and antisemitic bias … unprofessional … unethical … he must be after a promotion",
        "likes": 0,
        "published_at": "2026-01-28T15:59:44Z"
      },
      {
        "author": "@Zoran_balkan",
        "text": "It’s just video UK to wash their hands. NEVER put sanctions or something similar that’s mean they support Israel.",
        "likes": 0,
        "published_at": "2026-01-28T11:31:31Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:43.491930"
  },
  {
    "video_id": "Gbe2Kxg-KjQ",
    "title": "Many thousands confirmed killed in recent Iran protests | BBC News",
    "description": "The scale of the killings in Iran during the brutal recent crackdown on anti-government protesters is being laid bare.  One human rights group, whose estimates have proved accurate in the past, says it has verified more than 6,000 deaths.  The Human Rights Activists News Agency says it’s investigating reports of more than 17,000 other killings.    Other estimates have put the number who have died at more than 33,000. \n\nEvidence is emerging of the systematic killing of protesters, who took to the streets demanding the end of Iran’s theocratic regime.  Many of those who died were shot on the streets but there are reports of protesters being killed while being treated in hospital and people disappearing after being arrested at their homes. \n\nSome of the protesters have been telling the BBC about what they witnessed.  Parisa, a 29-year-old woman living in Tehran, said she knew at least 13 people who had been killed since the protests over economic conditions erupted in the capital on 28 December and evolved into one of the deadliest periods of anti-government unrest in the history of the Islamic Republic.  Mehdi, 24, also from Tehran, described witnessing multiple killings of protesters at close range by security forces.\n\nThe Iranian authorities have said that more than 3,100 people were killed, while claiming that most of them were security personnel or bystanders attacked by those they described as “rioters”. \n\nMost international news organisations, including the BBC, are barred from reporting inside Iran. But videos showing security forces firing live ammunition at crowds have been verified by the BBC.\n\nReeta Chakrabarti presents BBC News at Ten reporting by Caroline Hawley and Jonathan Beale. \n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
    "published_at": "2026-01-27T23:09:15Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "news",
      "world",
      "america",
      "usa",
      "Iran",
      "crisis",
      "economic",
      "economy",
      "protests",
      "streets",
      "demonstrations",
      "demonstrators",
      "protesters",
      "protestors",
      "Tehran",
      "death",
      "dictator",
      "Shah",
      "strikes",
      "Bazaar",
      "shopkeepers",
      "university",
      "students",
      "tear",
      "gas",
      "spread",
      "cities",
      "inflation",
      "currency",
      "devaluation",
      "dollar",
      "rial",
      "energy",
      "sanctions",
      "Israel",
      "Gaza",
      "Trump",
      "US",
      "United",
      "States",
      "war",
      "threat",
      "risk",
      "danger",
      "Lebanon",
      "Netanyahu",
      "Ayatollah",
      "Khamenei",
      "Putin",
      "India",
      "China",
      "Russia",
      "Pezeshkian",
      "democracy",
      "shot",
      "dead",
      "killed",
      "scale",
      "thousands",
      "injured",
      "Xi",
      "Modi",
      "attack",
      "toll",
      "fears",
      "crackdown"
    ],
    "category_id": "25",
    "duration": "PT5M51S",
    "views": 135580,
    "likes": 1139,
    "comments_count": 1105,
    "comments": [
      {
        "author": "@Jackspiring",
        "text": "I saw 30,000 in a report somewhere, even if it was 2,000 it’s unacceptable. That is a scared government warring against its OWN people",
        "likes": 35,
        "published_at": "2026-01-28T13:03:49Z"
      },
      {
        "author": "@knockedoutloaded",
        "text": "The IRGC stands for Islamic Revolutionary Guard Corp. Funny how the BBC sneakily changed that to Iranian Revolutionary Guard Corp. The properganda from the BBC is off the charts 😂",
        "likes": 57,
        "published_at": "2026-01-28T07:11:12Z"
      },
      {
        "author": "@محمدمهدیگلمحمدی-خ8و",
        "text": "Im from iran <br>Im connected to international net because i bought good vpn<br>Now im in city of qom <br>My friends father is working on emergency and he said <br>morgues are full of dead bodies. <br>Some human rights supported gaza <br>but they don&#39;t support iranian people<br><br>Our economy is destroyed . <br>1$=1600000rials of iran<br>With this numbers,<br>You can understand how is economy in iran . <br>    Death to the dictator",
        "likes": 9,
        "published_at": "2026-01-29T12:26:19Z"
      },
      {
        "author": "@unknownpersons91",
        "text": "In perfect timing for the American navy arriving in the area.<br><br>Building up the narrative are we before the attack.",
        "likes": 19,
        "published_at": "2026-01-28T06:39:43Z"
      },
      {
        "author": "@khaki714",
        "text": "My heart just  broke. Help these poor people.",
        "likes": 32,
        "published_at": "2026-01-27T23:48:08Z"
      },
      {
        "author": "@Michael-im2lk",
        "text": "Six thousand people did not die , they got murdered",
        "likes": 9,
        "published_at": "2026-01-29T10:12:38Z"
      },
      {
        "author": "@rick-y4b9p",
        "text": "based on what I&#39;ve seen online and in person, they&#39;ve killed tens of thousands and shut down internet for 20days to cover it up, I got lucky only got shot with metal pellets If you can call that luck...",
        "likes": 46,
        "published_at": "2026-01-28T03:53:10Z"
      },
      {
        "author": "@josephsheltonsr1484",
        "text": "Wow that&#39;s terrible 😮",
        "likes": 4,
        "published_at": "2026-01-28T02:13:16Z"
      },
      {
        "author": "@nancynevels2238",
        "text": "THIS IS ABSOLUTELY CRIMINAL!!!😢😢😈😈😤😤😤👀👀",
        "likes": 55,
        "published_at": "2026-01-27T23:56:06Z"
      },
      {
        "author": "@normannabatar6260",
        "text": "How can we verify that now when all of Starlink&#39;s terminals have been shutdown!  Former President Biden&#39;s NSA Advisor has also talked about how they have funded Starllink into Iran.<br><br>If Russia does not restart START, then it means it is contemplating on using ICBM to target US bases in the Middle East.  Via a proxy like North Korea.  These are hypersonic missiles that N. Korea has developed but more likely were moved and re-branded.",
        "likes": 2,
        "published_at": "2026-01-28T02:06:22Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:43.884787"
  },
  {
    "video_id": "wmtdg8iqtuA",
    "title": "Why wasn't KPop Demon Hunters nominated at Bafta? #KPop #Bafta #BBCNews",
    "description": "",
    "published_at": "2026-01-27T22:30:30Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT50S",
    "views": 91757,
    "likes": 697,
    "comments_count": 21,
    "comments": [
      {
        "author": "@user-cu5gc4qz8p",
        "text": "BAFTAs continuing to prove its irrelevance",
        "likes": 13,
        "published_at": "2026-01-28T00:38:49Z"
      },
      {
        "author": "@Practice19",
        "text": "Never seen it 👀",
        "likes": 8,
        "published_at": "2026-01-27T22:59:41Z"
      },
      {
        "author": "@admiralmallard7500",
        "text": "Shocking really",
        "likes": 0,
        "published_at": "2026-01-29T17:10:11Z"
      },
      {
        "author": "@Yoder023",
        "text": "Seems like someone gets snubbed from sonething each year.<br><br>Especially Oscars",
        "likes": 2,
        "published_at": "2026-01-28T09:33:34Z"
      },
      {
        "author": "@PaulinaEaster",
        "text": "I love you guys",
        "likes": 0,
        "published_at": "2026-01-29T15:40:36Z"
      },
      {
        "author": "@Lennyohlenny",
        "text": "Because a BAFTA is a worthless award. The popular stuff never wins. The pretentious stuff does.",
        "likes": 4,
        "published_at": "2026-01-28T08:11:56Z"
      },
      {
        "author": "@chooselife7882",
        "text": "because its rubbish",
        "likes": 1,
        "published_at": "2026-01-28T14:30:23Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:44.207610"
  },
  {
    "video_id": "ymh0MN8EhYs",
    "title": "Will the support package for pubs from the UK Government be enough? | BBC Newscast",
    "description": "Today, the chancellor has announced a package of support for pubs and music venues after the government was forced to U-turn on their plans to bump up business rates.   \n\nBBC Business editor Simon Jack joins Adam to explain the measures, whilst political correspondent Joe Pike drops by to unpack the government’s other big announcement of the day - capping ground rents at £250 a year for leaseholders.  \n\nPlus, the PM is on his way to Beijing. Ahead of his visit, Starmer said the UK cannot afford to ignore the economic opportunities presented by working with China. His visit comes after one of the country’s top generals was purged by the government. Our China correspondent Laura Bicker gives Adam a rundown of what to expect.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
    "published_at": "2026-01-27T22:01:05Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT35M17S",
    "views": 8661,
    "likes": 77,
    "comments_count": 26,
    "comments": [
      {
        "author": "@Mixedbeats18",
        "text": "Well is a start, if something happens with the Mercosul deal, Brazil got wheat, quite a lot",
        "likes": 1,
        "published_at": "2026-01-27T22:12:32Z"
      },
      {
        "author": "@ThinWhiteDude",
        "text": "Starmer is more bent than a U-bend...",
        "likes": 6,
        "published_at": "2026-01-28T08:56:28Z"
      },
      {
        "author": "@ravenmad9225",
        "text": "Labour are disastrous for our country.<br>We can&#39;t survive another three years of their sabotage.",
        "likes": 5,
        "published_at": "2026-01-28T01:25:57Z"
      },
      {
        "author": "@laneromel5667",
        "text": "Welfare for companies, just rewards stupidity.",
        "likes": 0,
        "published_at": "2026-01-27T22:50:46Z"
      },
      {
        "author": "@georgeroybooth3335",
        "text": "It takes forever for the penny to drop with Labour.    Ps. BBC - please stop your presenters from waving their arms about when they are speaking.",
        "likes": 2,
        "published_at": "2026-01-28T10:52:44Z"
      },
      {
        "author": "@BNCUSANewschannel",
        "text": "good news!",
        "likes": 0,
        "published_at": "2026-01-28T09:08:34Z"
      },
      {
        "author": "@S.H.A.D.O.Banner",
        "text": "Pubs are just passé. The State&#39;s taxed them out of existence",
        "likes": 4,
        "published_at": "2026-01-27T22:45:06Z"
      },
      {
        "author": "@JamesRichardJohnson",
        "text": "Every day there is business going into administration or full closure, if government dosent remove all taxes, you could see uk market shrink by half and see unemployment raise over 7%.",
        "likes": 0,
        "published_at": "2026-01-29T10:35:07Z"
      },
      {
        "author": "@cockyhussain",
        "text": "Who needs pubs in the Islamic Republic of Britannia? 😅",
        "likes": 5,
        "published_at": "2026-01-27T22:46:15Z"
      },
      {
        "author": "@T5Zplayer",
        "text": "Starmer&#39;s hatred of the forces not being reported then. He is a traitor.",
        "likes": 1,
        "published_at": "2026-01-28T12:27:41Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:44.465279"
  },
  {
    "video_id": "n5ZmUtPTSsQ",
    "title": "Valve facing £650m lawsuit over Steam game pricing in UK. #Valve #Gaming #BBCNews",
    "description": "",
    "published_at": "2026-01-27T21:15:07Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT1M7S",
    "views": 14234,
    "likes": 145,
    "comments_count": 84,
    "comments": [
      {
        "author": "@Engineering_M",
        "text": "&quot;Unreasonable prices&quot; Tell me you haven&#39;t used Steam without telling me you haven&#39;t used Steam",
        "likes": 175,
        "published_at": "2026-01-27T21:24:43Z"
      },
      {
        "author": "@uc12341",
        "text": "This is the dumbest lawsuit ever. Valve have the most pro consumer store front of the lot",
        "likes": 128,
        "published_at": "2026-01-27T22:06:49Z"
      },
      {
        "author": "@ShaquilleOatmeal849",
        "text": "Steam is like the one place where games are reasonably priced and have good sales… Why not take that lawsuit to Nintendo who are still selling almost decade old game at full price with no hopes of a sale 🙄",
        "likes": 59,
        "published_at": "2026-01-27T22:07:49Z"
      },
      {
        "author": "@markgriffiths41",
        "text": "&quot;valve forces game publishers&quot;  it sounds like valve is pointing a gun at the publisher&#39;s 😂",
        "likes": 22,
        "published_at": "2026-01-27T22:27:23Z"
      },
      {
        "author": "@jt.961",
        "text": "How are you locked you can add games bought elswhere onto the steam interface this is a joke",
        "likes": 35,
        "published_at": "2026-01-27T22:02:50Z"
      },
      {
        "author": "@windsorblue4852",
        "text": "I have steam, I also have, EA and epic. We all know we use steam because it&#39;s better. If something is expensive you buy a key elsewhere to use on steam anyway. Pointless lawsuit",
        "likes": 49,
        "published_at": "2026-01-27T22:00:48Z"
      },
      {
        "author": "@Think6.6",
        "text": "It&#39;s orchestrated by their competitors who haven&#39;t been able to compete on quality",
        "likes": 13,
        "published_at": "2026-01-28T06:13:14Z"
      },
      {
        "author": "@TheNinjaMonkey",
        "text": "What about being able to buy steam codes on other sites into the platform?",
        "likes": 12,
        "published_at": "2026-01-27T21:27:11Z"
      },
      {
        "author": "@KialWright",
        "text": "Locked onto using steam, bs its just better than epic, ea, and others and is also great for indie devs, the prices also are not bad and the constant sales are great!",
        "likes": 29,
        "published_at": "2026-01-27T21:24:03Z"
      },
      {
        "author": "@obipwn",
        "text": "Steam is popular because it is by far the most ethical platform. This is nonsense.",
        "likes": 8,
        "published_at": "2026-01-28T00:52:55Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:44.729428"
  },
  {
    "video_id": "aCA4tMAYPIU",
    "title": "Is Trump's 'Armada' going to attack Iran? | Global News Podcast",
    "description": "The Trump administration says a US aircraft carrier- the USS Abraham Lincoln- and supporting warships have arrived in the Middle East, expanding President Donald Trump's capabilities to defend US forces or take military action against Iran.\n\nThe US fleet including several guided missile destroyers are reported to be in striking range of Iranian territory.\n\nSince the crackdown began on protestors by the Iranian regime, President Trump has given mixed signals on intervention, but is now warning of a \"big armada next to Iran. Bigger than Venezuela.\" \n\nWe speak to the BBC's Defence Correspondent Jonathan Beale about what we know about US military capabilities in the region and what could happen next.\n\nSubscribe to the Global News Podcast wherever you get your podcasts or find more episodes here: https://bbc.in/GlobalNewsPodcastSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
    "published_at": "2026-01-27T21:00:00Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT11M23S",
    "views": 164929,
    "likes": 1238,
    "comments_count": 920,
    "comments": [
      {
        "author": "@SeanHassan-n3r",
        "text": "I doubt he&#39;s sent them there for show and tell",
        "likes": 119,
        "published_at": "2026-01-27T21:05:04Z"
      },
      {
        "author": "@helgef.johannesen4540",
        "text": "Realese ALL the Epstein-Files <br><br>Remember the Murders done by Trump regime on Americans",
        "likes": 17,
        "published_at": "2026-01-28T14:09:03Z"
      },
      {
        "author": "@amarendraborah6941",
        "text": "&quot;Only the dead have seen the end of war !&quot;<br>                                                 -  Plato.",
        "likes": 19,
        "published_at": "2026-01-28T03:40:00Z"
      },
      {
        "author": "@bradbastian2025",
        "text": "they dont move aircraft carriers to sit and do nothing , so DUH !!!!!",
        "likes": 55,
        "published_at": "2026-01-27T22:01:53Z"
      },
      {
        "author": "@kentbehr",
        "text": "Please bring in military generals for commentary on Iran situation not &quot;defence correspondents&quot;.",
        "likes": 29,
        "published_at": "2026-01-28T04:44:59Z"
      },
      {
        "author": "@AndreCheung-i6j",
        "text": "Of course he is as he is trying to take control of oil production , Venezuela and then Iran.",
        "likes": 4,
        "published_at": "2026-01-28T04:00:09Z"
      },
      {
        "author": "@TatungWu",
        "text": "During the 12-day war in June of last year, the United States and Israel launched attacks on Iran while negotiations were still underway. There were even allegations that Israeli actions targeted Iranian figures connected to the negotiating process. At the same time, former President Trump asserted that bunker-buster strikes had effectively destroyed Iran’s nuclear infrastructure. Against this backdrop, it is difficult to see how Iran could place any confidence in good-faith negotiations when talks can coincide with military action, negotiators can be killed, and declared objectives shift midstream. From Tehran’s perspective, Israel will not be satisfied short of regime destruction. Under such conditions, any future “negotiations” would likely be tactical rather than genuine—conducted without mutual trust and with neither side operating in good faith.",
        "likes": 11,
        "published_at": "2026-01-28T13:30:41Z"
      },
      {
        "author": "@adamharris1406",
        "text": "Iran already has old Trump: &quot; Go ahead and make your play, mister&quot;",
        "likes": 2,
        "published_at": "2026-01-28T16:05:08Z"
      },
      {
        "author": "@hourbee5535",
        "text": "The likelihood goes up as his need for a distraction goes up. So high chances indeed.",
        "likes": 61,
        "published_at": "2026-01-27T21:04:49Z"
      },
      {
        "author": "@jonallen292",
        "text": "60 minutes Australia did a story on gangsters in Dubai 2 years ago, I&#39;d like to see a story recovering that or expanding on it.",
        "likes": 12,
        "published_at": "2026-01-27T21:16:46Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:45.053726"
  },
  {
    "video_id": "RC7uhfTkrig",
    "title": "Holocaust Memorial Day \"more important than ever\", says author. #Holocaust #Auschwitz #BBCNews",
    "description": "",
    "published_at": "2026-01-27T20:23:24Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT1M31S",
    "views": 6930,
    "likes": 77,
    "comments_count": 11,
    "comments": [
      {
        "author": "@hiya99990",
        "text": "Victim narrative works better when you don&#39;t desperstely avoid talking about the millions displaced and thousands slaughtered",
        "likes": 6,
        "published_at": "2026-01-27T22:44:20Z"
      },
      {
        "author": "@jimmychoons5543",
        "text": "What day?",
        "likes": 2,
        "published_at": "2026-01-27T23:22:35Z"
      },
      {
        "author": "@diesel2gloxx",
        "text": "Free Palestine 🇵🇸",
        "likes": 11,
        "published_at": "2026-01-27T20:39:37Z"
      },
      {
        "author": "@Nooooooooooooooo1x",
        "text": "Yawnnnn . Why look at history when there is active genocide",
        "likes": 5,
        "published_at": "2026-01-27T21:40:44Z"
      },
      {
        "author": "@jeciel85",
        "text": "Godbless Israel.",
        "likes": 1,
        "published_at": "2026-01-28T15:52:13Z"
      },
      {
        "author": "@tomsawyer8543",
        "text": "America USA is the biggest terrorist country ever existed..killed millions of innocent civilians..destroyed so many countries..",
        "likes": 1,
        "published_at": "2026-01-28T12:33:52Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:45.292818"
  },
  {
    "video_id": "e0Hpe3ANiHM",
    "title": "'Holocaust Memorial Day is bridging generations’ | BBC Radio 4 Today",
    "description": "Dov Forman, a social media content creator who wrote the best-selling Lily’s Promise about his great-grandmother's life during World War Two, says marking Holocaust Memorial Day is “more important than ever”.\n \nJulia Kayes, who’s father Harry Olmer was one of the first Holocaust child survivors to move to the UK, said her father  was \"very keen that the legacy that he began” educating people about the Holocaust continues.\n \nThe remembrance day marks the liberation of Auschwitz-Birkenau, a concentration camp in Poland, in January 1945 and commemorates the six million Jews murdered during the Holocaust, and the millions more murdered under Nazi persecution.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#HolocaustMemorialDay #BBCNews",
    "published_at": "2026-01-27T20:00:36Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT4M43S",
    "views": 8922,
    "likes": 72,
    "comments_count": 0,
    "comments": [],
    "fetched_at": "2026-01-30T14:46:45.521919"
  },
  {
    "video_id": "6kkf5_YBN8w",
    "title": "New videos emerge from Iran as death toll continues to rise | BBC News",
    "description": "The BBC has been able to speak to several Iranians in recent days, as new footage emerges of the unprecedented crackdown on protests earlier this month. \n \nThe internet blackout is now patchy, after weeks where a total shutdown made it difficult to understand what was happening in the country. \n \nThe US-based Human Rights Activists News Agency (Hrana) says it has so far confirmed the killing of at least 6,159 people in Iran since the unrest began and is investigating another 17,000 reported deaths. \n \nIranian authorities said last week that more than 3,100 people had been killed, but that the majority were security personnel or bystanders attacked by \"rioters\".\n \nMost international news organisations, including the BBC, are barred from reporting inside Iran. But, videos showing security forces firing live ammunition at crowds have been verified by the BBC.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Iran #MiddleEast #BBCNews",
    "published_at": "2026-01-27T18:53:08Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT14M26S",
    "views": 464000,
    "likes": 3506,
    "comments_count": 1603,
    "comments": [
      {
        "author": "@kerry93",
        "text": "Hang on didn&#39;t you say the streets were empty and people had gone home 🤔 You guys are shameful",
        "likes": 65,
        "published_at": "2026-01-28T21:12:09Z"
      },
      {
        "author": "@BrickChoice",
        "text": "I&#39;m watching the BBC and I haven&#39;t paid for a licence. 😎🤣",
        "likes": 65,
        "published_at": "2026-01-27T20:26:33Z"
      },
      {
        "author": "@MrMPooky",
        "text": "How come it has taken you 19 days to ‘verify’ video footage from Iran. Pathetic.",
        "likes": 352,
        "published_at": "2026-01-27T19:20:39Z"
      },
      {
        "author": "@herberthue7273",
        "text": "But the title said &quot; new video emerge&quot; turn out it was 1st January footage...what a bulls..the hypocrisy of bbc",
        "likes": 17,
        "published_at": "2026-01-28T05:22:14Z"
      },
      {
        "author": "@knockedoutloaded",
        "text": "&quot;We&#39;ve ignored this because we can&#39;t verify&quot; That didn&#39;t stop the BBC reporting on Gaza 20 times every single day. I can&#39;t believe how far the BBC has fallen and they still think that we don&#39;t see what they&#39;re up to",
        "likes": 184,
        "published_at": "2026-01-28T06:57:22Z"
      },
      {
        "author": "@ThomasArmstrong-i1w",
        "text": "I am an old man, and I still do not understand how members of my own species have always been able, are able, and seemingly always will be able to be cold-blooded killers.",
        "likes": 81,
        "published_at": "2026-01-27T21:49:07Z"
      },
      {
        "author": "@sekhonyanaletsie9784",
        "text": "My worst fear is that the world is becoming dumber and dumber.",
        "likes": 22,
        "published_at": "2026-01-28T11:05:46Z"
      },
      {
        "author": "@annnilsson7587",
        "text": "May God protect innocent civilians in Iran 😢😢😢😢😢",
        "likes": 22,
        "published_at": "2026-01-27T23:12:48Z"
      },
      {
        "author": "@RustyRaceHorse",
        "text": "Says “new videos” and shows old videos from a week or two ago. BBC has ignored this…",
        "likes": 289,
        "published_at": "2026-01-27T18:59:42Z"
      },
      {
        "author": "@defectiveresistor",
        "text": "Those videos were shown the other week.",
        "likes": 123,
        "published_at": "2026-01-27T19:52:05Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:45.928978"
  },
  {
    "video_id": "Zf2NySBOSDU",
    "title": "New videos from Iran emerge as death toll continues to rise. #Iran #Protests #News #BBCNews",
    "description": "",
    "published_at": "2026-01-27T18:21:54Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT56S",
    "views": 22165,
    "likes": 355,
    "comments_count": 99,
    "comments": [
      {
        "author": "@mike8677",
        "text": "Such incompetent government",
        "likes": 3,
        "published_at": "2026-01-27T20:48:03Z"
      },
      {
        "author": "@justchilling2023",
        "text": "Ah yes, rapid gunfire and people just walking normally no panic.",
        "likes": 2,
        "published_at": "2026-01-27T21:58:00Z"
      },
      {
        "author": "@Mayeegan",
        "text": "The international community must come to the aid of the Iranian people. They have massacred 36,500 innocent people so far. We don&#39;t want these sick criminals, but we can&#39;t force them.",
        "likes": 1,
        "published_at": "2026-01-28T23:53:07Z"
      },
      {
        "author": "@dvvvvvg",
        "text": "Seems like all people of the world are just agents of Ayatollah&#39;s regime. We Iranians must never rely on you idiots.",
        "likes": 1,
        "published_at": "2026-01-28T09:21:09Z"
      },
      {
        "author": "@Generationspiano",
        "text": "Walt for the proper president. The intercessor I mean. Lol 😂",
        "likes": 0,
        "published_at": "2026-01-27T18:26:42Z"
      },
      {
        "author": "@minihodong",
        "text": "6000?! 😢",
        "likes": 1,
        "published_at": "2026-01-28T13:29:22Z"
      },
      {
        "author": "@WiliantoLiong-t5y",
        "text": "People desperately wanted regime altered.  😢",
        "likes": 1,
        "published_at": "2026-01-27T19:53:21Z"
      },
      {
        "author": "@TPlymouthaimusic",
        "text": "Freiheit für den Iran und sein Volk",
        "likes": 0,
        "published_at": "2026-01-29T10:59:30Z"
      },
      {
        "author": "@NegrónMusk",
        "text": "Mostly peacefull protests, Iranian edition.",
        "likes": 3,
        "published_at": "2026-01-27T19:31:51Z"
      },
      {
        "author": "@rozildoalvespinheiro8355",
        "text": "That&#39;s one real carnage of innocents people",
        "likes": 6,
        "published_at": "2026-01-28T00:16:14Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:46.173050"
  },
  {
    "video_id": "MWup--EveuI",
    "title": "Drone footage shows flooding caused by Storm Chandra. #StormChandra #BBCNews",
    "description": "",
    "published_at": "2026-01-27T17:08:18Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT17S",
    "views": 22245,
    "likes": 192,
    "comments_count": 22,
    "comments": [
      {
        "author": "@brandonprince3297",
        "text": "There has been concern about the effect of sea level rise on coastal towns, but changing rainfall patterns have led to flooding, landslips and sewage overflow. It might be that we need to learn more about hedge and ditch repair, river and canal management, but also the way we design building developments. At present, we are inadequately prepared for the possibility of a very different future environment.",
        "likes": 5,
        "published_at": "2026-01-27T17:31:50Z"
      },
      {
        "author": "@ericogle2845",
        "text": "I guess I&#39;ll be rice plantations eventually",
        "likes": 2,
        "published_at": "2026-01-28T06:44:22Z"
      },
      {
        "author": "@MarbleMasters1",
        "text": "😮😮😢",
        "likes": 0,
        "published_at": "2026-01-27T19:24:47Z"
      },
      {
        "author": "@ViewU-w7b",
        "text": "This channel is exactly what I needed I will definitely recommend this.",
        "likes": 1,
        "published_at": "2026-01-27T17:20:23Z"
      },
      {
        "author": "@dioghaltasfoirneartach7258",
        "text": "🫵😁  🏊‍♂️🚣‍♀️🏊🚣‍♂️🫵🤣",
        "likes": 0,
        "published_at": "2026-01-28T09:08:46Z"
      },
      {
        "author": "@S.H.A.D.O.Banner",
        "text": "Caused by COMPLETELY  INEPT civil planning",
        "likes": 1,
        "published_at": "2026-01-27T23:26:28Z"
      },
      {
        "author": "@ONE_SERVANT_OF_AL-LAAH_007T3",
        "text": "What happened...?<br>Bangladesh weather in Britain..<br>Flooding.. river over flow...😭😭",
        "likes": 3,
        "published_at": "2026-01-27T17:45:23Z"
      },
      {
        "author": "@jonajuanavelasco3246",
        "text": "BLESSED WORLD. BLESSED US ALL MORE… HIS people a SINNER(s)… Amen, Amen, Amen. Hallelujah, Hallelujah, Hallelujah 🙏🏻🙏🏻🙏🏻",
        "likes": 0,
        "published_at": "2026-01-27T21:40:36Z"
      },
      {
        "author": "@NobbingNobby",
        "text": "These areas are called ‘flood plains’ for a reason. Give the alarmism a rest.",
        "likes": 0,
        "published_at": "2026-01-27T18:39:43Z"
      },
      {
        "author": "@lw1zfog",
        "text": "Drone footage shows flooding caused by unfit for purpose councils failing to maintain the national infrastructure.",
        "likes": 1,
        "published_at": "2026-01-27T17:33:32Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:46.406476"
  },
  {
    "video_id": "62G_y35nRzA",
    "title": "Minnesota judge summons ICE chief | BBC News",
    "description": "A federal judge in Minnesota has ordered the acting ICE director to appear in court on Friday.\n \nDistrict Judge Patrick Schiltz said \"the court's patience is at an end\" and Todd Lyons must explain why his agency has failed to hold a bond hearing for an immigration detainee in the court-ordered timeframe.\n \nMeanwhile, Border Patrol Chief Gregory Bovino and some of his agents will leave Minneapolis following the fatal shooting of Alex Pretti on Saturday. \n \nThe Trump administration's \"border tsar\" Tom Homan will also head to the city to lead the immigration crackdown and meet with local officials. \n \nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Minneapolis #Minnesota #ICE #DonaldTrump #BBCNews",
    "published_at": "2026-01-27T17:05:02Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT4M55S",
    "views": 117311,
    "likes": 1552,
    "comments_count": 508,
    "comments": [
      {
        "author": "@HorrorFanatic-ws3te",
        "text": "They should all be arrested for their behaviour it is vile.",
        "likes": 200,
        "published_at": "2026-01-27T18:12:56Z"
      },
      {
        "author": "@jennychurchill2716",
        "text": "Surely Noem must testify too!!!",
        "likes": 47,
        "published_at": "2026-01-27T18:22:54Z"
      },
      {
        "author": "@LubegaSande-gx9yl",
        "text": "Tourists should boycott this yrs world cup cause the America of today is not safe.",
        "likes": 155,
        "published_at": "2026-01-27T18:36:16Z"
      },
      {
        "author": "@BrianCarney-p8c",
        "text": "All good news.  BOVINO’s a complete stooge.",
        "likes": 59,
        "published_at": "2026-01-27T17:49:49Z"
      },
      {
        "author": "@andrewtaylor9799",
        "text": "Pretti&#39;s shooters must be CRIMINALLY PROSECUTED. AMERICANS DESERVE JUSTICE.",
        "likes": 24,
        "published_at": "2026-01-27T20:18:19Z"
      },
      {
        "author": "@Chris-w1e8d",
        "text": "The Supreme Court should summon Trump.<br><br>Oh wait 🙄",
        "likes": 90,
        "published_at": "2026-01-27T18:11:08Z"
      },
      {
        "author": "@thesmithselvis",
        "text": "Homan was caught red handed taking a bribe of $50,000 from an undercover FBI agent posing as a private contractor seeking public projects. Trump prevented any investigation being carried out.",
        "likes": 111,
        "published_at": "2026-01-27T18:00:12Z"
      },
      {
        "author": "@Julia_Speaks",
        "text": "Trump offered to leave if Minneapolis officials handed over voter data. It was ALWAYS political intimidation, not enforcement.",
        "likes": 60,
        "published_at": "2026-01-27T18:38:07Z"
      },
      {
        "author": "@debbywillan5165",
        "text": "Big deal. They will get their wrist slapped but continue to do whatever they want, the courts are a joke. There is no accountability.",
        "likes": 39,
        "published_at": "2026-01-27T18:24:46Z"
      },
      {
        "author": "@sistersnake4629",
        "text": "DHS  is a Hydra with many faces /heads but zero change",
        "likes": 20,
        "published_at": "2026-01-27T18:52:15Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:46.699381"
  },
  {
    "video_id": "RrNFv2lb0Q8",
    "title": "Holocaust Memorial Day: Schoolchildren speak with survivors using AI | BBC News",
    "description": "Holocaust Memorial Day is held on the same day every year, marking the liberation date of the largest Nazi concentration camp complex, Auschwitz-Birkenau, on 27 January 1945.\n\nAs part of the commemorations, the Holocaust Educational Trust in the UK has launched a new project where school children can speak to survivors using artificial intelligence (AI).\n \nIt uses virtual reality headsets, allowing participants to immerse themselves in a survivor’s life story, including their experience in the concentration camps.\n \nThe objective is to educate young people about what previous generations inflicted and endured in a way that resonates today.  \n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Holocaust #Auschwitz #BBCNews",
    "published_at": "2026-01-27T14:00:50Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [
      "bbc",
      "bbc news",
      "news",
      "world news",
      "breaking news",
      "us news",
      "world",
      "america",
      "usa",
      "usa news",
      "india news"
    ],
    "category_id": "25",
    "duration": "PT4M54S",
    "views": 46691,
    "likes": 185,
    "comments_count": 256,
    "comments": [
      {
        "author": "@rgrg5442",
        "text": "I think the BBC uses AI. The prompt was: create the clip about Holocaust Memorial Day without using a word Jews.",
        "likes": 19,
        "published_at": "2026-01-28T01:35:11Z"
      },
      {
        "author": "@jeciel85",
        "text": "She refuse to say the word Jews.",
        "likes": 11,
        "published_at": "2026-01-28T15:44:50Z"
      },
      {
        "author": "@AugustusJulianus",
        "text": "Me mum died in the holly simulator 😢😢",
        "likes": 29,
        "published_at": "2026-01-27T14:51:42Z"
      },
      {
        "author": "@Bill-lg1xy",
        "text": "They are not talking to people they are talking to a machine.",
        "likes": 48,
        "published_at": "2026-01-27T14:19:21Z"
      },
      {
        "author": "@Chickenwings378",
        "text": "They made me gran into a headset and me da into a LLM.",
        "likes": 12,
        "published_at": "2026-01-27T16:46:56Z"
      },
      {
        "author": "@robertst.pierre2152",
        "text": "they killed my grandpa by painting a tunnel on a rock wall",
        "likes": 13,
        "published_at": "2026-01-27T22:29:05Z"
      },
      {
        "author": "@ivermektin6874",
        "text": "Can they speak to all 271,000 of them?",
        "likes": 13,
        "published_at": "2026-01-27T17:57:39Z"
      },
      {
        "author": "@davidockley2987",
        "text": "Has Sadik Khan positively remembered this day like other prominent members of his party?",
        "likes": 2,
        "published_at": "2026-01-29T15:31:16Z"
      },
      {
        "author": "@amarhadziabdic6595",
        "text": "There&#39;s really nothing they won&#39;t stoop to, huh",
        "likes": 2,
        "published_at": "2026-01-28T04:30:13Z"
      },
      {
        "author": "@user-zu9yp4xx8g",
        "text": "Me mum was turned into a lampshade in the holly mate",
        "likes": 1,
        "published_at": "2026-01-29T18:30:09Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:46.967734"
  },
  {
    "video_id": "fYtUavYJxao",
    "title": "Protest at hotel where US immigration chief reportedly staying. #BBCNews",
    "description": "",
    "published_at": "2026-01-27T12:39:32Z",
    "channel_id": "UC16niRr50-MSBwiO3YDb3RA",
    "channel_title": "BBC News",
    "tags": [],
    "category_id": "25",
    "duration": "PT1M39S",
    "views": 26062,
    "likes": 1176,
    "comments_count": 158,
    "comments": [
      {
        "author": "@gingin21jr",
        "text": "Say it!<br>It’s the Gestapo",
        "likes": 16,
        "published_at": "2026-01-28T08:38:45Z"
      },
      {
        "author": "@dogsbestfriend8988",
        "text": "No quarter for murders",
        "likes": 5,
        "published_at": "2026-01-28T19:37:29Z"
      },
      {
        "author": "@dogsbestfriend8988",
        "text": "No Justice, No Peace",
        "likes": 4,
        "published_at": "2026-01-28T19:36:12Z"
      },
      {
        "author": "@VinceSchreibtGeradeEinenKommi",
        "text": "PROJECT 2025 WE TRIED TO TELL YOU",
        "likes": 12,
        "published_at": "2026-01-27T21:18:24Z"
      },
      {
        "author": "@annanowak8529",
        "text": "In Poland, during Soviet times, there was the ZOMO, a special militia unit that became famous for its brutal suppression of demonstrations, strikes and protests, especially in the 1970s and 1980s.",
        "likes": 7,
        "published_at": "2026-01-27T18:48:27Z"
      },
      {
        "author": "@staceyannjustus8245",
        "text": "Why are the hotels giving them a place to stay? Don’t they have tents or holes they can crawl into?",
        "likes": 109,
        "published_at": "2026-01-27T14:40:29Z"
      },
      {
        "author": "@Aman.true99",
        "text": "Democracy at its best",
        "likes": 4,
        "published_at": "2026-01-27T19:44:21Z"
      },
      {
        "author": "@kerstinengelhardt1993",
        "text": "The damage is done.",
        "likes": 1,
        "published_at": "2026-01-28T19:54:07Z"
      },
      {
        "author": "@UnitedHUK",
        "text": "I never anticipated that the United States would one day resemble the authoritarian characteristics associated with 1930s Nazi Germany.",
        "likes": 98,
        "published_at": "2026-01-27T13:00:23Z"
      },
      {
        "author": "@myreviewstoday",
        "text": "Remind me… what boarder is there in Minneapolis?",
        "likes": 5,
        "published_at": "2026-01-27T18:49:31Z"
      }
    ],
    "fetched_at": "2026-01-30T14:46:47.240003"
  }
]